MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_dac.c
  * @brief   DAC HAL module driver.
  *
  *         This file provides firmware functions to manage the following
  *         functionalities of the Digital-to-Analog Converter (DAC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Input and output operation functions
  *           + Peripheral control functions
  *           + Peripheral state and error functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(DAC1)
#if defined(USE_HAL_DAC_MODULE) && (USE_HAL_DAC_MODULE == 1)

/** @defgroup DAC DAC
  * @{
  */
/** @defgroup DAC_Introduction DAC Introduction
  * @{

  - The DAC (Digital-to-Analog Converter) hardware abstraction layer provides a set of APIs to interface with the STM32
    DAC peripheral.
  - It simplifies the configuration, initialization, and management of analog output functionality, supporting
    various modes such as polling, interrupt, and DMA for efficient data transfer.
  - This abstraction layer ensures portability and ease of use across different STM32 series. The HAL DAC driver
    abstracts device-specific features.

  The HAL DAC driver includes the following features:
   - Output buffer management for driving external loads
   - Calibration features for improved analog output accuracy
   - Support for single and dual-channel operation
   - Advanced signal generation:
     - Noise
     - Triangle
   - User-defined buffer transfer via DMA
   - Sample-and-hold mode for low-power applications
  */
/**
  * @}
  */

/** @defgroup DAC_How_To_Use DAC How To Use
  * @{

  # DAC peripheral main features

  ## DAC channels

    On this STM32 series, DAC instances feature one or two channels depending on the device.
    @note Differentiation is made by the literal DAC_NB_OF_CHANNEL (defined in the DFP of each device).

    DAC channels have configurable resolution: 12-bit or 8-bit.
    They can be connected to device GPIO or on-chip peripherals.

    DAC channel conversion can be triggered by:
      - External event: EXTI Line
      - Other peripherals (timers, low-power timers, ...)
      - Software

    @note The trigger selection depends on the PWR mode, in STOP modes, only the triggers relative to peripherals
          that are functional in STOP modes are possible (ex: EXTI and LPTIM).

  ## DAC output buffer mode feature

    Each DAC channel integrates an output buffer that can be used to
    reduce the output impedance and drive external loads directly
    without adding an external amplifier.
    To enable the output buffer, use HAL_DAC_SetConfigChannel() to set HAL_DAC_OUTPUT_BUFFER_ENABLED.

    @note Refer to the device datasheet for more details about output
          impedance value with and without output buffer.

  ## Channel in separate mode, input and output operation

    + Use HAL_DAC_StartChannel() to enable one channel and start conversion
      for this channel.<br>
      Caution: when software trigger is selected, the call to HAL_DAC_StartChannel() starts
      the first conversion with the data previously present in DAC_DHRx register.
      Therefore, call HAL_DAC_SetChannelData() first to set the initial value of DAC_DHRx.
      Then subsequent conversions use data set with HAL_DAC_SetChannelData().
    + Use HAL_DAC_StopChannel() to disable one channel and stop conversion for this channel.
    + Use HAL_DAC_StartChannel_DMA() to enable one channel and start conversion
      for this channel using DMA to feed DAC converters.<br>
      Caution: the first issued trigger starts the conversion with the data previously present in DAC_DHRx register.
      Therefore, call HAL_DAC_SetChannelData() first to set the initial value of DAC_DHRx.<br>
    + Use HAL_DAC_StopChannel_DMA() to disable the channel and stop conversion for that channel using DMA.
    + Use HAL_DAC_SetChannelData() to set digital data to be converted.
    + Use HAL_DAC_GetChannelData() to get digital data to be converted.

  ## Dual-channel mode, input and output operation

    Dual mode allows the use of two DAC channels for simultaneous operation.

    + Use HAL_DAC_StartDualChannel() to enable both channels and start conversion
      for dual mode operation.<br>
      Caution: when software trigger is selected, the call to HAL_DAC_StartDualChannel() starts
      the first conversion with the data previously present in DAC_DHRx register.
      Therefore, a first call to HAL_DAC_SetDualChannelData is required in order to fix the initial value of DAC_DHRx.
      Then subsequent conversions use data set with HAL_DAC_SetDualChannelData().
    + Use HAL_DAC_StopDualChannel() to disable both channel and stop conversion
        for dual mode operation.
    + Use HAL_DAC_StartDualChannel_DMA() to enable both channels and start conversion
      for dual mode operation using DMA to feed DAC converters.<br>
      Caution: the first issued trigger starts the conversion with the data previously present in DAC_DHRx register.
      Therefore, a first call to HAL_DAC_SetDualChannelData is required in order to fix the initial value of DAC_DHRx.
      The same callbacks used in single mode are called in dual mode to notify
      transfer completion (half or complete), errors, or underrun.
    + Use HAL_DAC_StopDualChannel_DMA() to disable both channel and stop conversion
        for dual mode operation using DMA to feed DAC converters.

    + When dual-channel mode is enabled (i.e. DAC channel 1 and channel 2 are used simultaneously):
      use HAL_DAC_GetDualChannelData() to get digital data to be converted and use
        HAL_DAC_SetDualChannelData() to set digital data to be converted simultaneously in
        channel 1 and channel 2.

