MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
    ### Callback registration

      The compilation define, "USE_HAL_DAC_REGISTER_CALLBACKS", when set to 1,
      allows the user to configure driver callbacks dynamically.

       + Use HAL_DAC_RegisterConvHalfCpltCallback() to register
         HAL_DAC_ConvHalfCpltCallback(): callback when a half transfer is completed on a channel.
       + Use HAL_DAC_RegisterConvCpltCallback() to register
         HAL_DAC_ConvCpltCallback(): callback when a transfer is completed on a channel.
       + Use HAL_DAC_RegisterErrorCallback() to register
         HAL_DAC_ErrorCallback(): callback when an error occurs on a channel.

      These functions take the HAL peripheral handle and a pointer to the user callback function as parameters.

       By default, after the first HAL_DAC_Init(), all callbacks are reset to the corresponding
       legacy weak (overridden) functions.
      Register callbacks only in
       state HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED or HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED.
      When the compilation define USE_HAL_DAC_REGISTER_CALLBACKS is set to 0 or
      not defined, the callback registering feature is not available,
      and weak (overridden) callbacks are used.
  */
/**
  * @}
  */

/** @defgroup DAC_Configuration_Table DAC Configuration Table
  * @{
# Configuration in the DAC driver

  Config defines               | Description        | Default value | Note                                     |
-------------------------------| -------------------| ------------- | ------------------------------------------
USE_HAL_DAC_MODULE             | hal_conf.h         | 1 | HAL DAC module is enabled.
USE_HAL_DAC_USER_DATA          | hal_conf.h         | 0 | Enable user data.
USE_HAL_DAC_REGISTER_CALLBACKS | hal_conf.h         | 0 | Enable register callback assertions.
USE_HAL_DAC_CLK_ENABLE_MODEL | hal_conf.h | HAL_CLK_ENABLE_NO | Otherwise, the clock is enabled inside HAL_DAC_Init().
USE_HAL_DAC_DMA                | hal_conf.h         | 1 | Use DMA with the DAC.
USE_HAL_CHECK_PARAM            | hal_conf.h         | 0 | Enable run-time checks on function parameters.
USE_HAL_CHECK_PROCESS_STATE    | hal_conf.h         | 0 | Enable run-time checks on the state during processing.
USE_HAL_DAC_GET_LAST_ERRORS    | hal_conf.h         | 0 | Record errors that occur during DAC channel processing.
USE_HAL_DAC_DUAL_CHANNEL       | hal_conf.h         | 1 | Enable DAC dual channel mode (if DAC_NB_OF_CHANNEL > 1).
USE_ASSERT_DBG_PARAM           | Pre-processor env  | None | Enable assert checks on function parameters.
USE_ASSERT_DBG_STATE           | Pre-processor env  | None | Enable assert checks on module state.
DAC_NB_OF_CHANNEL              | DFP                | NA | DAC channel count (value "2" allows dual mode).

  ******************************************************************************
  */
/**
  * @}
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @addtogroup DAC_Private_Constants DAC Private Constants
  * @{
  */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
#define DAC_STATE_ALL (((uint32_t) HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED) \
                       | ((uint32_t) HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED)   \
                       | ((uint32_t) HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE))           /*!< DAC all states except IDLE */

#define DAC_STATE_CONFIG (((uint32_t) HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED) \
                          | ((uint32_t) HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED))    /*!< DAC all CONFIGURED states */
#else
#define DAC_STATE_ALL ((uint32_t) HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED)       /*!< DAC all states except IDLE */

#define DAC_STATE_CONFIG ((uint32_t) HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED)    /*!< DAC CONFIGURED states */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#else
#define DAC_STATE_ALL ((uint32_t) HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED)       /*!< DAC all states except IDLE */

#define DAC_STATE_CONFIG ((uint32_t) HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED)    /*!< DAC CONFIGURED states */
#endif /* DAC_NB_OF_CHANNEL */


#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
#define DAC_CHANNEL_STATE_ALL (((uint32_t) HAL_DAC_CHANNEL_STATE_IDLE)     \
                               | ((uint32_t) HAL_DAC_CHANNEL_STATE_ACTIVE) \
                               | ((uint32_t) HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT)) /*!< DAC CHANNEL all states */
#else
#define DAC_CHANNEL_STATE_ALL (((uint32_t) HAL_DAC_CHANNEL_STATE_IDLE)     \
                               | ((uint32_t) HAL_DAC_CHANNEL_STATE_ACTIVE)) /*!< DAC CHANNEL all states */
#endif /* USE_HAL_DAC_DMA  */

#define DAC_TIMEOUT_FOR_BWST_MS  1UL  /*!< Timeout of 1 ms after writing in DAC_SHSRx register */

/* Delay for DAC minimum trimming time.                                       */
/* Note: minimum time needed between two calibration steps                    */
/*       The delay below is specified under conditions:                       */
/*        - DAC channel output buffer enabled                                 */
/* Literal set to maximum value (refer to device datasheet,                   */
/* electrical characteristics, parameter "tTRIM").                            */
/* Unit: us                                                                   */
#define DAC_DELAY_TRIM_US      50UL  /*!< Delay of 50 us for DAC minimum trimming time */

/* High frequency interface mode selection. */
#define DAC_HFSEL_ENABLE_THRESHOLD_80MHZ   80000000U  /*!< High frequency clock selection:  80 MHz */
#define DAC_HFSEL_ENABLE_THRESHOLD_160MHZ  160000000U /*!< High frequency clock selection: 160 MHz */

/**
  * Delay for DAC channel voltage settling time from DAC channel startup
  * (transition from disable to enable).
  * Note: DAC channel startup time depends on board application environment:
  *       impedance connected to DAC channel output.
  *       The delay below is specified under conditions:
  *        - voltage maximum transition (lowest to highest value)
  *        - until voltage reaches final value +-1LSB
  *        - DAC channel output buffer enabled
  *        - load impedance of 5kOhm (min), 50pF (max)
  * Literal set to maximum value (refer to device datasheet,
  * parameter "tWAKEUP").
  * Unit: us
  */
#define DAC_DELAY_STARTUP_US    (15UL)  /*!< Delay of 15 us for DAC channel voltage settling time from DAC channel
                                             startup (transition from disable to enable) */
/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup DAC_Private_Macros DAC Private Macros
  * @{
  */

#define DAC_GET_INSTANCE(hdac) ((DAC_TypeDef *)((uint32_t)((hdac)->instance)))/*!< Retrieve DAC instance from handle */

