MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
#define DAC_GET_DMA_PARENT(hdma) ((hal_dac_handle_t *)((hdma)->p_parent))/*!< Retrieve DMA parent from handle */

#define DAC_GET_ALIGNMENT_FROM_DHR_ADDRESS(dhr_reg_base, dhr_reg)              \
  (((dhr_reg_base) >= (dhr_reg))                                               \
   ? (hal_dac_data_alignment_t)((uint32_t)(((dhr_reg_base) - (dhr_reg)) >> 2)) \
   : (HAL_DAC_DATA_ALIGN_12_BITS_RIGHT)                                        \
  )  /*!< Retrieve alignment from DHR register addresses */

#define DAC_GET_ALIGNMENT_CHANNEL(hdac, channel)                                                             \
  (DAC_GET_ALIGNMENT_FROM_DHR_ADDRESS((uint32_t)((hdac)->channel_dhr_address[(uint32_t)((channel))]),        \
                                      (uint32_t)(((uint32_t) &(DAC_GET_INSTANCE(hdac)->DHR12R1))             \
                                                 + (uint32_t)(3UL* sizeof(uint32_t) * (uint32_t)((channel))) \
                                                )                                                            \
                                     ))  /*!< Retrieve alignment from register addresses for a channel */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
#define DAC_GET_ALIGNMENT_DUAL(hdac)                                                                          \
  (DAC_GET_ALIGNMENT_FROM_DHR_ADDRESS((uint32_t)((hdac)->channel_dhr_address[(uint32_t)(HAL_DAC_CHANNEL_1)]), \
                                      (uint32_t)((uint32_t) &(DAC_GET_INSTANCE(hdac)->DHR12RD))               \
                                     ))  /*!< Retrieve alignment from register addresses for dual channel */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */

/*! Triggers */
#define IS_DAC_TRIGGER(hdac, trigger)  (((trigger) == HAL_DAC_TRIGGER_NONE)          \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM1_TRGO)  \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM2_TRGO)  \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM5_TRGO)  \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM6_TRGO)  \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM7_TRGO)  \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM8_TRGO)  \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM12_TRGO) \
                                        || ((trigger) == HAL_DAC_TRIGGER_TIM15_TRGO) \
                                        || ((trigger) == HAL_DAC_TRIGGER_LPTIM1_OC1) \
                                        || ((trigger) == HAL_DAC_TRIGGER_EXTI9)      \
                                        || ((trigger) == HAL_DAC_TRIGGER_SOFTWARE))

/*! High Frequencies mode selection */
#define  IS_DAC_HIGH_FREQUENCY_MODE(mode) (((mode) == HAL_DAC_HIGH_FREQ_MODE_DISABLED)       \
                                           || ((mode) == HAL_DAC_HIGH_FREQ_MODE_ABOVE_80MHZ) \
                                           || ((mode) == HAL_DAC_HIGH_FREQ_MODE_ABOVE_160MHZ))

/*! Sample time when "sample and hold mode" is enabled */
#define IS_DAC_SAMPLE_TIME(time)  ((time) <= 0x000003FFU)

/*! Hold time when "sample and hold mode" is enabled */
#define IS_DAC_HOLD_TIME(time)    ((time) <= 0x000003FFU)

/*! Refresh time when "sample and hold mode" is enabled */
#define IS_DAC_REFRESH_TIME(time) ((time) <= 0x000000FFUL)

/*! Sample and hold mode: enabled / disabled */
#define IS_DAC_SAMPLEANDHOLD(mode) (((mode) == HAL_DAC_SAMPLE_AND_HOLD_DISABLED) \
                                    || ((mode) == HAL_DAC_SAMPLE_AND_HOLD_ENABLED))

/*! Output connection */
#define IS_DAC_CHIP_CONNECTION(connect) (((connect) == HAL_DAC_OUTPUT_CONNECTION_EXTERNAL) \
                                         || ((connect) == HAL_DAC_OUTPUT_CONNECTION_INTERNAL))

/*! Calibration: check trimming value range */
#define IS_DAC_TRIMMINGVALUE(trimming_value) ((trimming_value) <= 0x1FU)

/*! Amplitude for triangle wave or pseudo noise wave (generated with LFSR) */
#define IS_DAC_WAVE_AMPLITUDE(value) (((value) == HAL_DAC_WAVE_AMPLITUDE_1)       \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_3)    \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_7)    \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_15)   \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_31)   \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_63)   \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_127)  \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_255)  \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_511)  \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_1023) \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_2047) \
                                      || ((value) == HAL_DAC_WAVE_AMPLITUDE_4095))

/*!  DMA double data mode (enable/disable) */
#define IS_DAC_DMA_DOUBLE_MODE(state) (((state) == HAL_DAC_DMA_DOUBLE_DATA_MODE_ENABLED) \
                                       || ((state) == HAL_DAC_DMA_DOUBLE_DATA_MODE_DISABLED))

/*! Data format (signed/unsigned) */
#define IS_DAC_SIGN_FORMAT(state) (((state) == HAL_DAC_SIGN_FORMAT_SIGNED) \
                                   || ((state) == HAL_DAC_SIGN_FORMAT_UNSIGNED))

/*! State of the channel output buffer (enable/disable) */
#define IS_DAC_OUTPUT_BUFFER_STATE(state) (((state) == HAL_DAC_OUTPUT_BUFFER_ENABLED) \
                                           || ((state) == HAL_DAC_OUTPUT_BUFFER_DISABLED))

/*! Check DAC channel */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#define IS_DAC_CHANNEL(hdac, channel) (((channel) == HAL_DAC_CHANNEL_1) \
                                       || ((channel) == HAL_DAC_CHANNEL_2))
#else
#define IS_DAC_CHANNEL(hdac, channel) ((channel) == HAL_DAC_CHANNEL_1)
#endif /* DAC_NB_OF_CHANNEL */

/*! To choose the alignment of the data */
#define IS_DAC_ALIGN(align) (((align) == HAL_DAC_DATA_ALIGN_12_BITS_RIGHT) \
                             || ((align) == HAL_DAC_DATA_ALIGN_12_BITS_LEFT) \
                             || ((align) == HAL_DAC_DATA_ALIGN_8_BITS_RIGHT))

/*! Check the data range */
#define IS_DAC_DATA(data) ((data) <= 0x0000FFF0UL)  /* Maximum value of 12 bit left alignment */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/*! Check the dual data range */
#define IS_DAC_DATA_DUAL(data) ((data) <= 0xFFF0FFF0UL) /* Maximum value of 12 bit left alignment */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */

