MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
/*! Check the double mode data range */
#define IS_DAC_DATA_DOUBLE_MODE(data) ((data) <= 0xFFF0FFF0UL) /* Maximum value of 12 bit left alignment */

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/*! Check the compatibility between HAL_DAC_OPT_DMA_IT_SILENT and DMA configuration */
#define IS_DAC_DMA_VALID_SILENT_MODE(handle_dma, interrupts) \
  (((interrupts) != HAL_DAC_OPT_DMA_IT_SILENT) \
   || (handle_dma->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR))
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_DAC_DMA */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @addtogroup DAC_Private_Variables DAC Private Variables
  * @{
  */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/*! Lookup table for channel identifier, to convert channel index from HAL_DAC_CHANNEL_x to LL_DAC_CHANNEL_x */
static const uint32_t lut_ch[DAC_NB_OF_CHANNEL] = {LL_DAC_CHANNEL_1,
                                                   LL_DAC_CHANNEL_2
                                                  };

/*! Lookup table for channel bit offset mask */
static const uint32_t lut_ch_shift[DAC_NB_OF_CHANNEL] = {(LL_DAC_CHANNEL_1 & DAC_CR_CHX_BITOFFSET_MASK),
                                                         (LL_DAC_CHANNEL_2 & DAC_CR_CHX_BITOFFSET_MASK)
                                                        };

/*! Lookup table for channel DMA underrun interrupt */
static const uint32_t lut_ch_dma_underrun_it[DAC_NB_OF_CHANNEL] = {LL_DAC_IT_DMAUDRIE1,
                                                                   LL_DAC_IT_DMAUDRIE2
                                                                  };

#else
/*! Lookup table for channel identifier, to convert channel index from HAL_DAC_CHANNEL_x to LL_DAC_CHANNEL_x */
static const uint32_t lut_ch[DAC_NB_OF_CHANNEL] = {LL_DAC_CHANNEL_1};

/*! Lookup table for channel bit offset mask */
static const uint32_t lut_ch_shift[DAC_NB_OF_CHANNEL] = {LL_DAC_CHANNEL_1 & DAC_CR_CHX_BITOFFSET_MASK};

/*! Lookup table for channel DMA underrun interrupt */
static const uint32_t lut_ch_dma_underrun_it[DAC_NB_OF_CHANNEL] = {LL_DAC_IT_DMAUDRIE1};

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/

/** @defgroup DAC_Private_Functions DAC Private Functions
  * @{
  */

static void DAC_WaitMicroSecond(uint32_t delay_us);

static void DAC_SetChannelAlignment(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                    hal_dac_data_alignment_t alignment);

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
static void DAC_SetDualChannelAlignment(hal_dac_handle_t *hdac, hal_dac_data_alignment_t alignment);

#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */
#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
static void DAC_SetChannelDMA(hal_dac_handle_t *hdac, hal_dma_handle_t *hdma, hal_dac_channel_t channel);
#endif /* USE_HAL_DAC_DMA */

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/* DAC_DMA_ChConvCplt / DAC_DMA_ChHalfConvCplt / DAC_DMA_ChError */
/* are set in HAL_DAC_StartChannel_DMA */
static void DAC_DMA_ChConvCplt(hal_dma_handle_t *hdma);
static void DAC_DMA_ChHalfConvCplt(hal_dma_handle_t *hdma);
static void DAC_DMA_ChStopCplt(hal_dma_handle_t *hdma);
static void DAC_DMA_ChError(hal_dma_handle_t *hdma);
static hal_status_t DAC_StartChannel_DMA_Opt(hal_dac_handle_t *hdac, hal_dac_channel_t channel, const void *p_data,
                                             uint32_t size_byte, uint32_t dac_opt_interrupt);
#endif /* USE_HAL_DAC_DMA */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/* DAC_DMA_DualChannelConvCplt / DAC_DMA_DualChannelHalfConvCplt / DAC_DMA_DualChannelError */
/* are set in HAL_DAC_StartDualChannel_DMA */
static void DAC_DMA_DualChannelConvCplt(hal_dma_handle_t *hdma);
static void DAC_DMA_DualChannelHalfConvCplt(hal_dma_handle_t *hdma);
static void DAC_DMA_DualChannelStopCplt(hal_dma_handle_t *hdma);
static void DAC_DMA_DualChannelError(hal_dma_handle_t *hdma);
hal_status_t DAC_StartDualChannel_DMA_Opt(hal_dac_handle_t *hdac, const void *p_data,
                                          uint32_t size_byte, uint32_t dac_opt_interrupt);
#endif /* USE_HAL_DAC_DMA */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
__STATIC_INLINE void DAC_IRQHandlerCH(hal_dac_handle_t *hdac, hal_dac_channel_t channel);

/**
  * @}
  */

/* Exported functions -------------------------------------------------------*/

/** @defgroup DAC_Exported_Functions HAL DAC Functions
  * @{
  */

/** @defgroup DAC_Exported_Functions_Group1_1 Initialization, de-initialization, configuration, calibration functions
    This section provides functions allowing to:
      + Initialize the DAC,
      + De-initialize the DAC,
      + Configure the DAC,
      + Chose optimum frequency,
      + Calibration setting.

  * @{
  */

/**
  * @brief  Initialize the DAC peripheral handle with a DAC instance.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  instance A DAC hardware peripheral base address.
  * @note   After calling this function, the DAC jumps to HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED, and it is possible
  *         to call directly HAL_DAC_StartCHannel() without calling HAL_DAC_SetConfig() or HAL_DAC_SetConfigChannel().
  *         In this case the DAC default configuration parameters are:
  *         + no DMA linked with DAC
  *         + HAL_DAC_HIGH_FREQ_MODE_DISABLED
  *         + HAL_DAC_SAMPLE_AND_HOLD_DISABLED
  *         + HAL_DAC_AM_DISABLED
  *         + HAL_DAC_DMA_DOUBLE_DATA_MODE_DISABLED
  *         + HAL_DAC_DATA_ALIGN_12_BITS_RIGHT
  *         + HAL_DAC_SIGN_FORMAT_UNSIGNED
  *         + HAL_DAC_TRIGGER_NONE
  *         + HAL_DAC_OUTPUT_BUFFER_ENABLED
  * @retval HAL_OK DAC instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  */
hal_status_t HAL_DAC_Init(hal_dac_handle_t *hdac, hal_dac_t instance)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_ALL_INSTANCE((DAC_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdac == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

