MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  hdac->instance = instance;

#if (USE_HAL_DAC_REGISTER_CALLBACKS == 1) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_conv_cplt_cb      = HAL_DAC_ConvCpltCallback;
  hdac->p_conv_half_cplt_cb = HAL_DAC_ConvHalfCpltCallback;
  hdac->p_error_cb          = HAL_DAC_ErrorCallback;
  hdac->p_stop_cplt_cb      = HAL_DAC_StopCpltCallback;
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
  hdac->p_dual_channel_conv_cplt_cb      = HAL_DAC_DualChannelConvCpltCallback;
  hdac->p_dual_channel_conv_half_cplt_cb = HAL_DAC_DualChannelConvHalfCpltCallback;
  hdac->p_dual_channel_stop_cplt_cb      = HAL_DAC_DualChannelStopCpltCallback;
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */

#if defined(USE_HAL_DAC_CLK_ENABLE_MODEL) && (USE_HAL_DAC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_DAC1_EnableClock();
#endif /* USE_HAL_DAC_CLK_ENABLE_MODEL */

  for (uint32_t index = 0; index < DAC_NB_OF_CHANNEL; index++)
  {
    hdac->channel_state[index] = HAL_DAC_CHANNEL_STATE_IDLE;

    /* Set default alignment (12-bit right-aligned) for each channel */
    DAC_SetChannelAlignment(hdac, (hal_dac_channel_t)index, HAL_DAC_DATA_ALIGN_12_BITS_RIGHT);

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
    hdac->last_error_codes[(uint32_t)index] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
  }

  hdac->global_state = HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED;
  return HAL_OK;
}

/**
  * @brief  Deinitialize the DAC peripheral.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @note   Stop the DAC and restore the state machine to reset state.
  */
void HAL_DAC_DeInit(hal_dac_handle_t *hdac)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  p_instance = DAC_GET_INSTANCE(hdac);
  ASSERT_DBG_PARAM(IS_DAC_ALL_INSTANCE(p_instance));

#if defined (USE_HAL_DAC_USER_DATA) && (USE_HAL_DAC_USER_DATA == 1)
  hdac->p_user_data = NULL;
#endif /* USE_HAL_DAC_USER_DATA */

  for (uint32_t index = 0; index < DAC_NB_OF_CHANNEL; index++)
  {
    LL_DAC_Disable(p_instance, lut_ch[index]);

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
    hdac->last_error_codes[(uint32_t)index] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

    hdac->channel_state[index] = HAL_DAC_CHANNEL_STATE_IDLE;
  }

  hdac->global_state = HAL_DAC_STATE_RESET;
}

/**
  * @brief  Get the optimum frequency interface mode for the DAC peripheral.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @note   After calling this function, set the optimum high frequency interface mode (HFSEL bits)
  *         with HAL_DAC_SetConfig().
  * @retval hal_dac_high_freq_mode_t Optimum frequency interface mode.
  */
hal_dac_high_freq_mode_t HAL_DAC_GetOptimumFrequencyMode(const hal_dac_handle_t *hdac)
{
  hal_dac_high_freq_mode_t optimum_freq_mode;
  uint32_t hclkfreq;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  STM32_UNUSED(hdac);

  /* Get the system core clock frequency */
  hclkfreq = HAL_RCC_GetHCLKFreq();

  if (hclkfreq > DAC_HFSEL_ENABLE_THRESHOLD_160MHZ)
  {
    /* HCLK higher than 160 Mhz is available */
    optimum_freq_mode = HAL_DAC_HIGH_FREQ_MODE_ABOVE_160MHZ;
  }
  else if (hclkfreq > DAC_HFSEL_ENABLE_THRESHOLD_80MHZ)
  {
    /* HCLK higher than 80 Mhz is available */
    optimum_freq_mode = HAL_DAC_HIGH_FREQ_MODE_ABOVE_80MHZ;
  }
  else
  {
    /* HCLK lower than 80 Mhz, so disable high frequency mode */
    optimum_freq_mode = HAL_DAC_HIGH_FREQ_MODE_DISABLED;
  }

  return optimum_freq_mode;
}

/**
  * @brief  Configure the DAC peripheral according to the specified parameters in the hal_dac_config_t.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  p_config  The configuration that contains information for the specified DAC.
  * @note   By calling this function, the high frequency interface mode (HFSEL bits) is set.
  *         Optionally, before calling this function, the optimum high frequency interface mode (HFSEL bits)
  *         could be determined with HAL_DAC_GetOptimumFrequencyMode().
  * @retval HAL_OK DAC instance has been correctly configured.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  */
hal_status_t HAL_DAC_SetConfig(hal_dac_handle_t *hdac, const hal_dac_config_t *p_config)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DAC_HIGH_FREQUENCY_MODE(p_config->high_frequency_mode));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

#endif /* DAC_NB_OF_CHANNEL */
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }

#endif /* USE_HAL_CHECK_PARAM */
  p_instance = DAC_GET_INSTANCE(hdac);
  LL_DAC_SetHighFrequencyMode(p_instance, (uint32_t)(p_config->high_frequency_mode));

  return HAL_OK;
}

/**
  * @brief  Return the configuration parameters of the DAC peripheral
  *         in the hal_dac_config_t.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  p_config The configuration parameters.
  */
void HAL_DAC_GetConfig(const hal_dac_handle_t *hdac, hal_dac_config_t *p_config)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Set the high frequency interface mode selection */
  p_config->high_frequency_mode = (hal_dac_high_freq_mode_t) LL_DAC_GetHighFrequencyMode(p_instance);
}

/**
  * @brief  Reset the configuration parameters of the DAC and its channels.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @note   Configuration parameters of the DAC are reset to:
  *         + DAC is disabled and no more DMA is running with DAC
  *         + normal mode operation (ie: not in calibration mode)
  *         + high frequency disabled
  *         + sample and hold mode is disabled
  *         + no wave generation
  *         + DMA double data mode is disabled
  *         + unsigned data
  *         + 12 bits right alignment
  *         + trigger none
  *         + output buffer enabled
  *         + external pin connection
  */
void HAL_DAC_ResetConfig(hal_dac_handle_t *hdac)
{
  DAC_TypeDef *p_instance;
  uint32_t reg_value;
  uint32_t reg_mask;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

#endif /* DAC_NB_OF_CHANNEL */

