MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  p_instance = DAC_GET_INSTANCE(hdac);

  /* Reset the configuration items to their default/HW reset values */
  for (uint32_t index = 0; index < DAC_NB_OF_CHANNEL; index++)
  {
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
    hdac->last_error_codes[(uint32_t)index] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
    hdac->dma_ch[(uint32_t)index]  = NULL;
#endif /* USE_HAL_DAC_DMA */

    reg_value = LL_DAC_READ_REG(p_instance, CR);

    reg_mask = ((DAC_CR_EN1)          /* To disable the DAC channel */
                | (DAC_CR_DMAEN1)     /* To disable the selected DAC channel DMA request */
                | (DAC_CR_DMAUDRIE1)  /* To disable the DAC DMA underrun interrupt */
                | (DAC_CR_CEN1)       /* To set operation mode normal */
                | (DAC_CR_WAVE1)      /* To disable the wave generation */
                | (DAC_CR_MAMP1)      /* To disable the DAC channel mask/amplitude selector */
                | (DAC_CR_TSEL1)      /* To set trigger selection to software */
                | (DAC_CR_TEN1)       /* To disable the trigger (ie TRIGGER_NONE) */
                | (DAC_MCR_HFSEL)     /* To disable the High Frequency Mode */
               ) << lut_ch_shift[index];
    reg_value &= ~reg_mask ;
    reg_value |= ((uint32_t)(LL_DAC_MODE_NORMAL_OPERATION)
                  | (uint32_t)(LL_DAC_WAVE_AUTO_GENERATION_NONE)
                  | (uint32_t)(LL_DAC_TRIGGER_SOFTWARE)
                  | (uint32_t)(LL_DAC_HIGH_FREQ_MODE_DISABLED)
                 ) << lut_ch_shift[index];

    LL_DAC_Disable(p_instance, lut_ch[index]);   /* first write CR to set EN bit to 0 */
    LL_DAC_WRITE_REG(p_instance, CR, reg_value); /* then write again CR to set CEN bit to 0 after EN bit is set to 0 */

    reg_value = LL_DAC_READ_REG(p_instance, MCR);

    reg_mask = ((DAC_MCR_SINFORMAT1)
                | (DAC_MCR_MODE1_0)
                | (DAC_MCR_MODE1_1)
                | (DAC_MCR_MODE1_2)
                | (DAC_MCR_DMADOUBLE1)
               ) << lut_ch_shift[index];
    reg_value &= ~reg_mask ;
    reg_value |= ((uint32_t)(LL_DAC_SIGN_FORMAT_UNSIGNED)
                  | (uint32_t)(LL_DAC_OUTPUT_CONNECT_EXTERNAL)
                  | (uint32_t)(LL_DAC_OUTPUT_BUFFER_ENABLE)
                  | (uint32_t)(LL_DAC_OUTPUT_MODE_NORMAL)
                 ) << lut_ch_shift[index];

    /* Set MCR bits after CR bits because writing to MODE[] bits needs that EN and CEN bits are set to 0 */
    LL_DAC_WRITE_REG(p_instance, MCR, reg_value);

    /* Set default alignment for each channel */
    DAC_SetChannelAlignment(hdac, (hal_dac_channel_t)index, HAL_DAC_DATA_ALIGN_12_BITS_RIGHT);
  }
  hdac->global_state = HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED;
}

/**
  * @brief  Run the calibration of one DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The DAC channel.
  * @note   Calibration runs about 2 ms per channel.
  * @retval HAL_OK When HAL_OK the channel buffer has been calibrated correctly.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  */
hal_status_t HAL_DAC_CalibrateChannelBuffer(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  hal_status_t status = HAL_OK;
  DAC_TypeDef *p_instance;

  uint32_t output_buffer_mode;
  uint32_t trimming_value;
  uint32_t delta;
  uint32_t flag;

  ASSERT_DBG_PARAM((hdac != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdac == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Store output buffer configuration */
  output_buffer_mode = LL_DAC_GetOutputBuffer(p_instance, lut_ch[channel]);

  LL_DAC_Disable(p_instance, lut_ch[channel]);

  /* Set mode in MCR for calibration */
  LL_DAC_SetOutputBuffer(p_instance, lut_ch[channel], LL_DAC_OUTPUT_BUFFER_ENABLE);

  /* Enable the selected DAC channel calibration */
  LL_DAC_SetMode(p_instance, lut_ch[channel], LL_DAC_MODE_CALIBRATION);

  /* Init trimming counter */
  /* Medium value */
  trimming_value = 0x10UL;
  delta = 0x08UL;
  while (delta != 0UL)
  {
    /* Set candidate trimming */
    LL_DAC_SetTrimmingValue(p_instance, lut_ch[channel], (trimming_value & DAC_CCR_OTRIM1));

    /* Wait minimum time needed between two calibration steps (OTRIM) */
    DAC_WaitMicroSecond(DAC_DELAY_TRIM_US);

    flag = LL_DAC_IsActiveFlag_CAL(p_instance, lut_ch[channel]);

    if (flag == 1U)
    {
      /* DAC_SR_CAL_FLAGx is HIGH try lower trimming */
      trimming_value -= delta;
    }
    else
    {
      /* DAC_SR_CAL_FLAGx is LOW try higher trimming */
      trimming_value += delta;
    }
    delta >>= 1UL;
  }

  /* Still need to check if  trimming_value calibration is current value or one step below */
  /* Indeed the first value that causes the DAC_SR_CAL_FLAGx bit to change from 0 to 1  */
  /* Set candidate trimming */
  LL_DAC_SetTrimmingValue(p_instance, lut_ch[channel], (trimming_value & DAC_CCR_OTRIM1));

  /* Wait minimum time needed between two calibration steps (OTRIM) */
  DAC_WaitMicroSecond(DAC_DELAY_TRIM_US);

  flag = LL_DAC_IsActiveFlag_CAL(p_instance, lut_ch[channel]);

  if (flag == 0UL)
  {
    /* Check trimming value below maximum */
    if (trimming_value < DAC_CCR_OTRIM1)
    {
      /* Trimming is actually one value more */
      trimming_value++;
    }
    /* Set right trimming */
    LL_DAC_SetTrimmingValue(p_instance, lut_ch[channel], (trimming_value & DAC_CCR_OTRIM1));
  }

  /* Disable the DAC channel calibration */
  LL_DAC_SetMode(p_instance, lut_ch[channel], LL_DAC_MODE_NORMAL_OPERATION);

  /* Restore configuration */
  LL_DAC_SetOutputBuffer(p_instance, lut_ch[channel], output_buffer_mode);

  return status;
}

/**
  * @brief  Set a trimming offset value.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  value DAC offset trimming value to be set. This parameter must be a number the range [1,31].
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_SetChannelBufferCalibrationValue(hal_dac_handle_t *hdac, hal_dac_channel_t channel, uint32_t value)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));
  ASSERT_DBG_PARAM(IS_DAC_TRIMMINGVALUE(value));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

