MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  p_instance = DAC_GET_INSTANCE(hdac);

  LL_DAC_SetTrimmingValue(p_instance, lut_ch[channel], (value & DAC_CCR_OTRIM1));

  return HAL_OK;
}

/**
  * @brief  Return the DAC trimming value.
  * @param  hdac DAC handle
  * @param  channel The selected DAC channel.
  * @retval Trimming value in range [0, 31].
  *
 */
uint32_t HAL_DAC_GetChannelBufferCalibrationValue(const hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  p_instance = DAC_GET_INSTANCE(hdac);

  return LL_DAC_GetTrimmingValue(p_instance, lut_ch[channel]);
}

/**
  * @}
  */  /* Endgroup DAC_Exported_Functions_Group1_1 */

/** @defgroup DAC_Exported_Functions_Group1_2  Separate channel mode configuration functions
    This section provides functions allowing to:
      + Configure the DAC channels in separate channel mode.
  * @{
  */

/**
  * @brief  Configure the selected DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  p_config DAC configuration structure.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK  DAC instance has been correctly configured.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  */
hal_status_t HAL_DAC_SetConfigChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                      const hal_dac_channel_config_t *p_config)
{
  DAC_TypeDef *p_instance;
  uint32_t reg_value;
  uint32_t reg_mask;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  p_instance = DAC_GET_INSTANCE(hdac);
  ASSERT_DBG_PARAM(IS_DAC_ALL_INSTANCE(p_instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_DAC_TRIGGER(hdac, p_config->trigger));
  ASSERT_DBG_PARAM(IS_DAC_OUTPUT_BUFFER_STATE(p_config->output_buffer));
  ASSERT_DBG_PARAM(IS_DAC_CHIP_CONNECTION(p_config->output_connection));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));
  ASSERT_DBG_PARAM(IS_DAC_SIGN_FORMAT(p_config->data_sign_format));
  ASSERT_DBG_PARAM(IS_DAC_ALIGN(p_config->alignment));
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  /* Calculate and store the channel data hold register address from the given channel and alignment */
  DAC_SetChannelAlignment(hdac, channel, p_config->alignment);

  /* Configure mode and trigger */

  reg_value = LL_DAC_READ_REG(p_instance, CR);
  reg_mask = ((DAC_CR_CEN1)     /* To set operation mode normal (disable calibration)*/
              | (DAC_CR_TSEL1)  /* To set trigger selection to HAL_DAC_TRIGGER_SOFTWARE */
              | (DAC_CR_TEN1)   /* To disable the trigger (ie TRIGGER_NONE) */
             ) << lut_ch_shift[channel];
  reg_value &= ~reg_mask ;

  if (p_config->trigger ==  HAL_DAC_TRIGGER_NONE)
  {
    /* Is set to HAL_DAC_TRIGGER_SOFTWARE to reset previous trigger */
  }
  else
  {
    reg_value |= ((uint32_t)(p_config->trigger)
                  | (DAC_CR_TEN1)   /* To enable the trigger */
                 ) << lut_ch_shift[channel];
  }

  LL_DAC_WRITE_REG(p_instance, CR, reg_value);

  /* Configure DAC channel signed format and output mode */
  /* Set MCR bits after CR bits because writing to MODE[] bits needs that EN and CEN bits are set to 0 */

  reg_value = LL_DAC_READ_REG(p_instance, MCR);

  reg_mask = ((DAC_MCR_SINFORMAT1) | (DAC_MCR_MODE1_1) | (DAC_MCR_MODE1_0)) << lut_ch_shift[channel];
  reg_value &= ~reg_mask ;
  reg_value |= ((uint32_t)(p_config->data_sign_format)
                | (uint32_t)(p_config->output_buffer)
                | (uint32_t)(p_config->output_connection)
               ) << lut_ch_shift[channel];

  LL_DAC_WRITE_REG(p_instance, MCR, reg_value);

  hdac->global_state = HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED;
  hdac->channel_state[channel] = HAL_DAC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get configuration for a channel.
  * @param hdac Pointer to a hal_dac_handle_t structure.
  * @param channel The selected DAC channel.
  * @param p_config Pointer to a channel configuration structure parameters.
  */
void HAL_DAC_GetConfigChannel(const hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                              hal_dac_channel_config_t *p_config)
{
  DAC_TypeDef *p_instance;
  uint32_t reg_value;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], ((uint32_t)DAC_CHANNEL_STATE_ALL));

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Fill config structure parameter */
  reg_value = LL_DAC_READ_REG(p_instance, MCR);
  reg_value >>= (lut_ch_shift[channel]);

  p_config->data_sign_format  = (hal_dac_sign_format_t)((uint32_t)(reg_value & (DAC_MCR_SINFORMAT1)));
  p_config->output_buffer     = (hal_dac_output_buffer_status_t)((uint32_t)(reg_value & (DAC_MCR_MODE1_1)));
  p_config->output_connection = (hal_dac_output_connection_t)((uint32_t)(reg_value & (DAC_MCR_MODE1_0)));

  p_config->trigger = HAL_DAC_TRIGGER_NONE;
  if (LL_DAC_IsTriggerEnabled(p_instance, lut_ch[channel]) != 0UL)
  {
    p_config->trigger = (hal_dac_trigger_t) LL_DAC_GetTriggerSource(p_instance, lut_ch[channel]);
  }

  /* Calculate and return the alignment from the stored data hold register address */
  p_config->alignment = DAC_GET_ALIGNMENT_CHANNEL(hdac, channel);
}

/**
  * @brief  Set the data width and alignment for the DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  alignment  The alignment and data width:
  *                    12 bits right alignment, 12 bits left alignment, 8 bits right alignment.
  * @retval HAL_OK DAC instance has been correctly configured.
  */
hal_status_t HAL_DAC_SetChannelAlignment(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                         hal_dac_data_alignment_t alignment)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_ALIGN(alignment));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

  DAC_SetChannelAlignment(hdac, channel, alignment);
  return HAL_OK;
}

/**
  * @brief  Get the data width and alignment for the DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval hal_dac_data_alignment_t The data width and alignment for the DAC channel.
  */
hal_dac_data_alignment_t HAL_DAC_GetChannelAlignment(const hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  hal_dac_data_alignment_t alignment;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

