MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  /* Calculate and return the alignment from the stored data hold register address */
  alignment = DAC_GET_ALIGNMENT_CHANNEL(hdac, channel);

  return alignment;
}

/**
  * @}
  */  /* Endgroup DAC_Exported_Functions_Group1_2 */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/** @defgroup DAC_Exported_Functions_Group1_3 Dual channel mode configuration functions
  *     This section provides functions allowing to:
      + Configure the DAC in dual channel mode.
  * @{
  */

/**
  * @brief Set dual channel configuration.
  * @param hdac Pointer to a hal_dac_handle_t structure.
  * @param p_config Pointer to a dual channel configuration structure parameters.
  * @retval HAL_OK DAC instance has been correctly configured.
  * @retval HAL_INVALID_PARAM A parameter is invalid.
  */
hal_status_t HAL_DAC_SetConfigDualChannel(hal_dac_handle_t *hdac, const hal_dac_dual_channel_config_t *p_config)
{
  DAC_TypeDef *p_instance;
  uint32_t reg_value;
  uint32_t reg_mask;
  ASSERT_DBG_PARAM((hdac != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_DAC_ALIGN(p_config->alignment));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Calculate and store the dual data hold register address from the given alignment */
  /* Stored in [HAL_DAC_CHANNEL_1] as separate channel is not running when in dual channel */
  DAC_SetDualChannelAlignment(hdac, p_config->alignment);

  /* Configure mode and trigger */

  reg_value = LL_DAC_READ_REG(p_instance, CR);
  reg_mask = ((DAC_CR_CEN1)     /* To set operation mode normal (disable calibration)*/
              | (DAC_CR_TSEL1)  /* To set trigger selection to HAL_DAC_TRIGGER_SOFTWARE */
              | (DAC_CR_TEN1)   /* To disable the trigger (ie TRIGGER_NONE) */
             ) << lut_ch_shift[HAL_DAC_CHANNEL_1];
  reg_mask |= ((DAC_CR_CEN1)     /* To set operation mode normal (disable calibration)*/
               | (DAC_CR_TSEL1)  /* To set trigger selection to HAL_DAC_TRIGGER_SOFTWARE */
               | (DAC_CR_TEN1)   /* To disable the trigger (ie TRIGGER_NONE) */
              ) << lut_ch_shift[HAL_DAC_CHANNEL_2];
  reg_value &= ~reg_mask ;

  if (p_config->channel1_config.trigger == HAL_DAC_TRIGGER_NONE)
  {
    /* Is set to HAL_DAC_TRIGGER_SOFTWARE to reset previous trigger */
  }
  else
  {
    reg_value |= ((uint32_t)(p_config->channel1_config.trigger)
                  | (DAC_CR_TEN1)   /* To enable the trigger */
                 ) << lut_ch_shift[HAL_DAC_CHANNEL_1];
  }

  if (p_config->channel2_config.trigger == HAL_DAC_TRIGGER_NONE)
  {
    /* Is set to HAL_DAC_TRIGGER_SOFTWARE to reset previous trigger */
  }
  else
  {
    reg_value |= ((uint32_t)(p_config->channel2_config.trigger)
                  | (DAC_CR_TEN1)   /* To enable the trigger */
                 ) << lut_ch_shift[HAL_DAC_CHANNEL_2];
  }
  LL_DAC_WRITE_REG(p_instance, CR, reg_value);

  /* Configure DAC channel signed format and output mode */
  /* Set MCR bits after CR bits because writing to MODE[] bits needs that EN and CEN bits are set to 0 */

  reg_value = LL_DAC_READ_REG(p_instance, MCR);

  reg_mask  = ((DAC_MCR_SINFORMAT1) | (DAC_MCR_MODE1_1) | (DAC_MCR_MODE1_0)) << lut_ch_shift[HAL_DAC_CHANNEL_1];
  reg_mask |= ((DAC_MCR_SINFORMAT1) | (DAC_MCR_MODE1_1) | (DAC_MCR_MODE1_0)) << lut_ch_shift[HAL_DAC_CHANNEL_2];

  reg_value &= ~reg_mask ; /* Reset bits to be modified */
  reg_value |= ((uint32_t)(p_config->channel1_config.data_sign_format)
                | (uint32_t)(p_config->channel1_config.output_buffer)
                | (uint32_t)(p_config->channel1_config.output_connection)
               ) << lut_ch_shift[HAL_DAC_CHANNEL_1];

  reg_value |= ((uint32_t)(p_config->channel2_config.data_sign_format)
                | (uint32_t)(p_config->channel2_config.output_buffer)
                | (uint32_t)(p_config->channel2_config.output_connection)
               ) << lut_ch_shift[HAL_DAC_CHANNEL_2];

  LL_DAC_WRITE_REG(p_instance, MCR, reg_value);

  hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Get dual channel configuration.
  * @param hdac Pointer to a hal_dac_handle_t structure.
  * @param p_config Pointer to a dual channel configuration structure parameters.
  */
void HAL_DAC_GetConfigDualChannel(const hal_dac_handle_t *hdac, hal_dac_dual_channel_config_t *p_config)
{
  DAC_TypeDef *p_instance;
  uint32_t reg_value;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Retrieve and fill config from register for channel 1 and channel 2 */

  reg_value = LL_DAC_READ_REG(p_instance, MCR);
  p_config->channel1_config.data_sign_format  = (hal_dac_sign_format_t)((uint32_t)(reg_value & (DAC_MCR_SINFORMAT1)));
  p_config->channel1_config.output_buffer     = (hal_dac_output_buffer_status_t)
                                                ((uint32_t)(reg_value & (DAC_MCR_MODE1_1)));
  p_config->channel1_config.output_connection = (hal_dac_output_connection_t)
                                                ((uint32_t)(reg_value & (DAC_MCR_MODE1_0)));

  reg_value >>= (lut_ch_shift[HAL_DAC_CHANNEL_2]);
  p_config->channel2_config.data_sign_format  = (hal_dac_sign_format_t)((uint32_t)(reg_value & (DAC_MCR_SINFORMAT1)));
  p_config->channel2_config.output_buffer     = (hal_dac_output_buffer_status_t)
                                                ((uint32_t)(reg_value & (DAC_MCR_MODE1_1)));
  p_config->channel2_config.output_connection = (hal_dac_output_connection_t)
                                                ((uint32_t)(reg_value & (DAC_MCR_MODE1_0)));

  reg_value  = LL_DAC_READ_REG(p_instance, CR);
  p_config->channel1_config.trigger = HAL_DAC_TRIGGER_NONE;
  /* Update for HAL_DAC_TRIGGER_NONE (ie: trigger bit CR.TENx not enabled)*/
  if ((reg_value & (DAC_CR_TEN1)) != 0UL)
  {
    p_config->channel1_config.trigger = (hal_dac_trigger_t)((uint32_t)(reg_value & (DAC_CR_TSEL1)));
  }

  p_config->channel2_config.trigger = HAL_DAC_TRIGGER_NONE;
  if ((reg_value & (DAC_CR_TEN2)) != 0UL)
  {
    p_config->channel2_config.trigger = (hal_dac_trigger_t)((uint32_t)((reg_value & (DAC_CR_TSEL2))
                                                                       >> (lut_ch_shift[HAL_DAC_CHANNEL_2])));
  }

  /* Retrieve alignment */
  /* Calculate and return the alignment from the stored data hold register address */
  p_config->alignment = DAC_GET_ALIGNMENT_DUAL(hdac);
}

/**
  * @brief Set dual channel alignment.
  * @param hdac Pointer to a hal_dac_handle_t structure.
  * @param  alignment  The alignment and data width:
  *                    12 bits right alignment, 12 bits left alignment, 8 bits right alignment.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_SetDualChannelAlignment(hal_dac_handle_t *hdac,  hal_dac_data_alignment_t alignment)
{
  ASSERT_DBG_PARAM(IS_DAC_ALIGN(alignment));

