MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  /* Calculate and store the dual data hold register address from the given alignment */
  /* Stored in [HAL_DAC_CHANNEL_1] as separate channel is not running when in dual channel */
  DAC_SetDualChannelAlignment(hdac, alignment);

  return HAL_OK;
}

/**
  * @brief Set dual channel alignment.
  * @param hdac Pointer to a hal_dac_handle_t structure.
  * @retval alignment  The alignment and data width:
  *                    12 bits right alignment, 12 bits left alignment, 8 bits right alignment.
  */
hal_dac_data_alignment_t HAL_DAC_GetDualChannelAlignment(const hal_dac_handle_t *hdac)
{
  hal_dac_data_alignment_t alignment;

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  /* Retrieve alignment from the dual data hold register address stored in [HAL_DAC_CHANNEL_1] */
  alignment = DAC_GET_ALIGNMENT_DUAL(hdac);

  return alignment ;
}

/**
  * @}
  */   /* Endgroup DAC_Exported_Functions_Group1_3 */

#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */

/** @defgroup DAC_Exported_Functions_Group2_1 Separate channel mode, input and output operation functions
     This section provides functions allowing to:
   + Enable a "software trigger" conversion,
   + Start conversion in separate channel mode,
   + Stop conversion in separate channel mode,
   + Start conversion and enable DMA transfer in separate channel mode,
   + Stop conversion and disable DMA transfer in separate channel mode,
   + Set the data in holding register for DAC channel in separate channel mode,
   + Get the converted data in separate channel mode.

  * @{
  */

/**
  * @brief  DAC channel software trigger conversion.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK or HAL_ERROR if software trigger is not enabled.
  */
hal_status_t HAL_DAC_TrigSWConversionChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

  p_instance = DAC_GET_INSTANCE(hdac);

  if (LL_DAC_IsTriggerSWEnabled(p_instance, lut_ch[channel]) != 0U)
  {
    /* Enable the selected DAC software conversion */
    LL_DAC_TrigSWConversion(p_instance, lut_ch[channel]);
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Enable DAC and start conversion of channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_StartChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  p_instance = DAC_GET_INSTANCE(hdac);

  hdac->channel_state[(int32_t) channel] = HAL_DAC_CHANNEL_STATE_ACTIVE;

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  hdac->last_error_codes[channel] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

  LL_DAC_Enable(p_instance, lut_ch[channel]);
  /* Ensure minimum wait before using peripheral after enabling it */
  DAC_WaitMicroSecond(DAC_DELAY_STARTUP_US);

  return HAL_OK;
}

/**
  * @brief  Disable DAC and stop conversion of channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_StopChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE);

  p_instance = DAC_GET_INSTANCE(hdac);

  LL_DAC_Disable(p_instance, lut_ch[channel]);

  hdac->channel_state[channel] = HAL_DAC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the data holding register value for DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  data Data to be loaded in the selected data holding register.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_SetChannelData(hal_dac_handle_t *hdac, hal_dac_channel_t channel, uint32_t data)
{
  DAC_TypeDef *p_instance;
  uint32_t mask;
  uint32_t tmp_reg;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  p_instance = DAC_GET_INSTANCE(hdac);

  /* In case DMA Double data mode is activated, DATA range is almost full uin32_t one: no check */
  if (LL_DAC_IsDMADoubleDataModeEnabled(p_instance, lut_ch[channel]) == 0U)
  {
    ASSERT_DBG_PARAM(IS_DAC_DATA(data));
  }
  else
  {
    ASSERT_DBG_PARAM(IS_DAC_DATA_DOUBLE_MODE(data));
  }

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)DAC_CHANNEL_STATE_ALL);

  /**
    * Set the DAC channel selected data holding register.
    * The tmp_reg variable is needed to avoid changing other bits (ex: DAC_DHR12L2).
    * The mask takes into account those single mode alignments:
    * 0x000000FF for 8BR, 0x00000FFF for 12BR or 0x0000FFF0  for 12BL.
    */
  mask = 0x0000FFFF;
  tmp_reg = *(volatile uint32_t *) hdac->channel_dhr_address[channel];
  tmp_reg &= ~mask;
  tmp_reg = (tmp_reg | (data & mask));
  *(volatile uint32_t *) hdac->channel_dhr_address[channel] = tmp_reg;

  return HAL_OK;
}

/**
  * @brief  Return the last data output value of the selected DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval The selected DAC channel data output value.
  */
uint32_t HAL_DAC_GetChannelData(const hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

