MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  p_instance = DAC_GET_INSTANCE(hdac);
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)DAC_CHANNEL_STATE_ALL);

  return (LL_DAC_RetrieveOutputData(p_instance, lut_ch[channel]));
}

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/**
  * @brief  Set the link between DAC channel and a DMA handler.
  * @param  hdac Pointer to hal_dac_handle_t structure.
  * @param  hdma Pointer to the DMA handler to be linked with the DAC channel.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_SetChannelDMA(hal_dac_handle_t *hdac, hal_dma_handle_t *hdma, hal_dac_channel_t channel)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

  DAC_SetChannelDMA(hdac, hdma, channel);
  return HAL_OK;
}

/**
  * @brief  Enable DAC and start conversion of channel with DMA.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  p_data The source buffer address.
  * @param  size_byte The number of bytes of data to be transferred from memory to DAC peripheral
  * @retval HAL_OK DAC instance has been correctly configured with the DMA.
  * @retval HAL_ERROR An internal inconsistency error or a parameter is invalid.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          DMA channel state is active when calling this API.
  */
hal_status_t HAL_DAC_StartChannel_DMA(hal_dac_handle_t *hdac, hal_dac_channel_t channel, const void *p_data,
                                      uint32_t size_byte)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((hdac != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hdac, channel_state[channel], HAL_DAC_CHANNEL_STATE_IDLE, HAL_DAC_CHANNEL_STATE_ACTIVE);

  status =  DAC_StartChannel_DMA_Opt(hdac, channel, p_data, size_byte, (uint32_t)HAL_DAC_OPT_DMA_IT_DEFAULT);

  if (status != HAL_OK)
  {
    /* Revert DAC channel state */
    hdac->channel_state[channel] = HAL_DAC_CHANNEL_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Enable DAC and start conversion of channel with DMA and optional interruption.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  p_data The source buffer address.
  * @param  size_byte The number of bytes of data to be transferred from memory to DAC peripheral
  * @param  dac_opt_interrupt The DAC optional interrupt flag.
  * @retval HAL_OK DAC instance has been correctly configured with the DMA.
  * @retval HAL_ERROR An internal inconsistency error or a parameter is invalid.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          DMA channel state is active when calling this API.
  */
hal_status_t HAL_DAC_StartChannel_DMA_Opt(hal_dac_handle_t *hdac, hal_dac_channel_t channel, const void *p_data,
                                          uint32_t size_byte, uint32_t dac_opt_interrupt)
{
  hal_status_t status;
  hal_dac_channel_state_t new_channel_state;

  ASSERT_DBG_PARAM((hdac != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_DAC_DMA_VALID_SILENT_MODE(hdac->dma_ch[channel], dac_opt_interrupt));
#endif /* USE_HAL_DMA_LINKEDLIST */

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (dac_opt_interrupt == HAL_DAC_OPT_DMA_IT_SILENT)
  {
    new_channel_state = HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    new_channel_state = HAL_DAC_CHANNEL_STATE_ACTIVE;
  }
  HAL_CHECK_UPDATE_STATE(hdac, channel_state[channel], HAL_DAC_CHANNEL_STATE_IDLE, new_channel_state);

  status = DAC_StartChannel_DMA_Opt(hdac, channel, p_data, size_byte, dac_opt_interrupt);

  if (status != HAL_OK)
  {
    /* Revert DAC channel state */
    hdac->channel_state[channel] = HAL_DAC_CHANNEL_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Disable DAC and stop conversion of channel with DMA.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK DMA successfully stopped.
  */
hal_status_t HAL_DAC_StopChannel_DMA(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;
  hal_dma_handle_t *p_hdma;
  hal_status_t status;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[channel],
                   (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE | (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT);

  p_instance = DAC_GET_INSTANCE(hdac);
  p_hdma = hdac->dma_ch[channel];

  LL_DAC_DisableDMAReq(p_instance, lut_ch[channel]);

  LL_DAC_DisableIT_DMAUDR(p_instance, lut_ch_dma_underrun_it[channel]);

  LL_DAC_Disable(p_instance, lut_ch[channel]);

  if (hdac->channel_state[channel] == HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT)
  {
    (void)HAL_DMA_Abort(p_hdma); /* (void) because irrelevant return status in silent mode */
    hdac->global_state = HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED;
    hdac->channel_state[channel] = HAL_DAC_CHANNEL_STATE_IDLE;
  }
  else
  {
    p_hdma->p_xfer_abort_cb = DAC_DMA_ChStopCplt;
    status = HAL_DMA_Abort_IT(p_hdma);
    /* DAC global_state and channel_state are changed inside DAC_DMA_ChStopCplt() */
    if (status != HAL_OK)
    {
      DAC_DMA_ChStopCplt(p_hdma);
    }
  }

  return HAL_OK;
}

#endif /* USE_HAL_DAC_DMA */

/**
  * @}
  */   /* Endgroup DAC_Exported_Functions_Group2_1 */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/** @defgroup DAC_Exported_Functions_Group2_2 Dual mode, input and output operation functions
     This section provides functions allowing to:
   + Enable a "software trigger" for dual channel conversion,
   + Start conversion in dual channel mode,
   + Stop conversion in dual channel mode,
   + Start conversion and enable DMA transfer in dual channel mode,
   + Stop conversion and disable DMA transfer in dual channel mode,
   + Set the data in holding register for DAC channel in dual channel mode,
   + Get the converted data in dual channel mode.
  * @{
  */

#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/**
  * @brief  DAC dual channel software trigger conversion.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval HAL_OK or HAL_ERROR if software trigger is not enabled.
  */
hal_status_t HAL_DAC_TrigSWConversionDualChannel(hal_dac_handle_t *hdac)
{
  uint32_t tmp_swtrig_ch = 0UL;
  DAC_TypeDef *p_instance;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hdac != NULL));

