MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Check both channels to see whether the software trigger is enabled */
  if (LL_DAC_IsTriggerSWEnabled(p_instance, LL_DAC_CHANNEL_1) != 0UL)
  {
    tmp_swtrig_ch |= LL_DAC_CHANNEL_1;
    status = HAL_OK;
  }
  if (LL_DAC_IsTriggerSWEnabled(p_instance, LL_DAC_CHANNEL_2) != 0UL)
  {
    tmp_swtrig_ch |= LL_DAC_CHANNEL_2;
    status = HAL_OK;
  }

  /* Enable the selected DAC software conversion*/
  LL_DAC_TrigSWConversion(p_instance, (uint32_t)(tmp_swtrig_ch));

  return status;
}

/**
  * @brief  Enable DAC and start conversion of both channels in dual channel mode.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_StartDualChannel(hal_dac_handle_t *hdac)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  p_instance = DAC_GET_INSTANCE(hdac);

  hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE;
  hdac->channel_state[HAL_DAC_CHANNEL_1] = HAL_DAC_CHANNEL_STATE_ACTIVE;
  hdac->channel_state[HAL_DAC_CHANNEL_2] = HAL_DAC_CHANNEL_STATE_ACTIVE;

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  hdac->last_error_codes[HAL_DAC_CHANNEL_1] = (uint16_t)HAL_DAC_ERROR_NONE;
  hdac->last_error_codes[HAL_DAC_CHANNEL_2] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

  /* Enable the Peripheral */
  LL_DAC_DualChannelEnable(p_instance);

  /* Ensure minimum wait before using peripheral after enabling it */
  DAC_WaitMicroSecond(DAC_DELAY_STARTUP_US);

  return HAL_OK;
}

/**
  * @brief  Disable DAC and stop conversion of both channels.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_StopDualChannel(hal_dac_handle_t *hdac)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  p_instance = DAC_GET_INSTANCE(hdac);

  LL_DAC_DualChannelDisable(p_instance);

  hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED;
  hdac->channel_state[HAL_DAC_CHANNEL_1] = HAL_DAC_CHANNEL_STATE_IDLE;
  hdac->channel_state[HAL_DAC_CHANNEL_2] = HAL_DAC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the specified data holding register value for dual DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure that contains
  *               the configuration information for the specified DAC.
  * @param  data Data for DAC channel 1 and DAC channel 2 to be loaded in the selected data holding register.
  * @warning  In dual mode, a unique register access is required to write in both
  *           DAC channels at the same time. The data value given by the user must be a concatenation of channel 1
  *           data and channel 2 data, according to the used alignment as described in the reference manual.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_SetDualChannelData(hal_dac_handle_t *hdac, uint32_t data)
{
  volatile uint32_t *tmp;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM(IS_DAC_DATA_DUAL(data));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  /* Set the dual data holding register */
  tmp = hdac->channel_dhr_address[(uint32_t)HAL_DAC_CHANNEL_1]; /* dual dhr address is recorded in index 0 */
  *(volatile uint32_t *) tmp = data;

  return HAL_OK;
}

/**
  * @brief  Return the last dual data output value of the dual channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval The dual channel data output value.
  */
uint32_t HAL_DAC_GetDualChannelData(const hal_dac_handle_t *hdac)
{
  uint32_t tmp;
  const DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  p_instance = DAC_GET_INSTANCE(hdac);

  tmp  = LL_DAC_READ_REG(p_instance, DOR1);
  tmp |= LL_DAC_READ_REG(p_instance, DOR2) << 16UL;

  /* Returns the DAC dual channel data output value */
  return tmp;
}
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/**
  * @brief  Set the link between DAC and a DMA handler in dual channel mode.
  * @param  hdac Pointer to hal_dac_handle_t structure.
  * @param  hdma Pointer to the DMA handler to be linked with the DAC in dual channel mode.
  * @param  dma_requester_channel The channel that does the request to the DMA.
  * @warning  DMA dual channel is set in dma_ch[HAL_DAC_CHANNEL_1] so it is not possible to used simultaneously
  *           DMA dual channel mode and DMA in single channel mode.
  *           To go back in DMA single channel mode, user must call HAL_DAC_SetChannelDMA().
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_SetDualChannelDMA(hal_dac_handle_t *hdac, hal_dma_handle_t *hdma,
                                       hal_dac_channel_t dma_requester_channel)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, dma_requester_channel));

  hdac->dual_channel_dma_requester = dma_requester_channel;

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);

  DAC_SetChannelDMA(hdac, hdma, dma_requester_channel);
  return HAL_OK;
}

/**
  * @brief  Enable DAC, and start conversion with a DMA, of both channels of the same DAC, with optional interruption.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  p_data The destination peripheral Buffer address.
  * @param  size_byte The number of data to be transferred from memory to DAC peripheral.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  */
hal_status_t HAL_DAC_StartDualChannel_DMA(hal_dac_handle_t *hdac, const void *p_data, uint32_t size_byte)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((hdac != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hdac, global_state, HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED, HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  HAL_CHECK_UPDATE_STATE(hdac, channel_state[HAL_DAC_CHANNEL_1], HAL_DAC_CHANNEL_STATE_IDLE,
                         HAL_DAC_CHANNEL_STATE_ACTIVE);
  HAL_CHECK_UPDATE_STATE(hdac, channel_state[HAL_DAC_CHANNEL_2], HAL_DAC_CHANNEL_STATE_IDLE,
                         HAL_DAC_CHANNEL_STATE_ACTIVE);

