MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  status = DAC_StartDualChannel_DMA_Opt(hdac, p_data, size_byte, (uint32_t)HAL_DAC_OPT_DMA_IT_DEFAULT);

  if (status != HAL_OK)
  {
    /* Revert DAC state and DAC channel state */
    hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED;
    hdac->channel_state[HAL_DAC_CHANNEL_1] = HAL_DAC_CHANNEL_STATE_IDLE;
    hdac->channel_state[HAL_DAC_CHANNEL_2] = HAL_DAC_CHANNEL_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Enable DAC, and start conversion with a DMA, of both channels of the same DAC, with optional interruption.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  p_data The destination peripheral Buffer address.
  * @param  size_byte The number of data to be transferred from memory to DAC peripheral.
  * @param  dac_opt_interrupt The DAC optional interrupt flag.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  */
hal_status_t HAL_DAC_StartDualChannel_DMA_Opt(hal_dac_handle_t *hdac, const void *p_data, uint32_t size_byte,
                                              uint32_t dac_opt_interrupt)
{
  hal_status_t status;
  hal_dac_channel_state_t new_channel_state;

  ASSERT_DBG_PARAM((hdac != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2], (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_DAC_DMA_VALID_SILENT_MODE(hdac->dma_ch[hdac->dual_channel_dma_requester], dac_opt_interrupt));
#endif /* USE_HAL_DMA_LINKEDLIST */

  HAL_CHECK_UPDATE_STATE(hdac, global_state, HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED, HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (dac_opt_interrupt == HAL_DAC_OPT_DMA_IT_SILENT)
  {
    new_channel_state = HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    new_channel_state = HAL_DAC_CHANNEL_STATE_ACTIVE;
  }
  HAL_CHECK_UPDATE_STATE(hdac, channel_state[HAL_DAC_CHANNEL_1], HAL_DAC_CHANNEL_STATE_IDLE, new_channel_state);
  HAL_CHECK_UPDATE_STATE(hdac, channel_state[HAL_DAC_CHANNEL_2], HAL_DAC_CHANNEL_STATE_IDLE, new_channel_state);

  status = DAC_StartDualChannel_DMA_Opt(hdac, p_data, size_byte, (uint32_t)dac_opt_interrupt);

  if (status != HAL_OK)
  {
    /* Revert DAC state and DAC channel state */
    hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED;
    hdac->channel_state[HAL_DAC_CHANNEL_1] = HAL_DAC_CHANNEL_STATE_IDLE;
    hdac->channel_state[HAL_DAC_CHANNEL_2] = HAL_DAC_CHANNEL_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Disable DAC, and stop conversion with DMA, for both channels.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval HAL_OK DMA successfully stopped.
  */
hal_status_t HAL_DAC_StopDualChannel_DMA(hal_dac_handle_t *hdac)
{
  DAC_TypeDef *p_instance;
  hal_dma_handle_t *p_hdma;
  hal_status_t status;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED |
                   (uint32_t)HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE);

  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_1],
                   (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE | (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT);
  ASSERT_DBG_STATE(hdac->channel_state[HAL_DAC_CHANNEL_2],
                   (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE | (uint32_t)HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT);

  p_instance = DAC_GET_INSTANCE(hdac);

  p_hdma = hdac->dma_ch[hdac->dual_channel_dma_requester];

  LL_DAC_DisableDMAReq(p_instance, lut_ch[hdac->dual_channel_dma_requester]);

  LL_DAC_DisableIT_DMAUDR(p_instance, lut_ch_dma_underrun_it[hdac->dual_channel_dma_requester]);

  LL_DAC_DualChannelDisable(p_instance);

  if (hdac->channel_state[HAL_DAC_CHANNEL_1] == HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT) /* CHANNEL_2 has same state */
  {
    (void)HAL_DMA_Abort(p_hdma); /* (void) because irrelevant return status in silent mode */
    hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED;
    hdac->channel_state[HAL_DAC_CHANNEL_1] = HAL_DAC_CHANNEL_STATE_IDLE;
    hdac->channel_state[HAL_DAC_CHANNEL_2] = HAL_DAC_CHANNEL_STATE_IDLE;
  }
  else
  {
    p_hdma->p_xfer_abort_cb = DAC_DMA_DualChannelStopCplt;
    status = HAL_DMA_Abort_IT(p_hdma);
    /* DAC global_state and channel_state are changed inside DAC_DMA_DualChannelStopCplt() */
    if (status != HAL_OK)
    {
      DAC_DMA_DualChannelStopCplt(p_hdma);
    }
  }
  return HAL_OK;
}

#endif /* USE_HAL_DAC_DMA */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

/**
  * @}
  */   /* Endgroup DAC_Exported_Functions_Group2_2 */
#endif /* DAC_NB_OF_CHANNEL */

/** @defgroup DAC_Exported_Functions_Group3 Peripheral control functions
  This section provides functions allowing to set and configure the DAC main features:
    + the DMA double data mode,
    + the autonomous mode,
    + the configuration for the sample and hold mode,
    + the triangle wave addition,
    + the noise wave addition.
  * @{
  */
#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/**
  * @brief  Enable the DAC DMA double data mode.
  * @param  hdac Pointer to a hal_dac_handle_t.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK.
  */

hal_status_t HAL_DAC_EnableChannelDMADoubleDataMode(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  /* To change from double data to single data mode or vice versa: the DAC channel must be disabled */
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE((hdac->channel_state[(uint32_t)channel]), (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

