MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  p_instance = DAC_GET_INSTANCE(hdac);

  /* Update the MCR register */
  LL_DAC_EnableDMADoubleDataMode(p_instance, lut_ch[channel]);
  return HAL_OK;
}

/**
  * @brief  Disable the DAC DMA double data mode.
  * @param  hdac Pointer to a hal_dac_handle_t.
  * @param  channel The selected DAC channel.
  * @retval HAL_OK.
  */
hal_status_t HAL_DAC_DisableChannelDMADoubleDataMode(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  /* To change from double data to single data mode or vice versa: the DAC channel must be disabled */
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE((hdac->channel_state[(uint32_t)channel]), (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Update the MCR register */
  LL_DAC_DisableDMADoubleDataMode(p_instance, lut_ch[channel]);

  return HAL_OK;
}

/**
  * @brief  Check whether the DAC DMA double data mode is enabled.
  * @param  hdac Pointer to a hal_dac_handle_t.
  * @param  channel The selected DAC channel.
  * @retval hal_dac_dma_double_data_mode_status_t State of DMA double data mode:
            + HAL_DAC_DMA_DOUBLE_DATA_MODE_ENABLED
            + HAL_DAC_DMA_DOUBLE_DATA_MODE_DISABLED.
  */
hal_dac_dma_double_data_mode_status_t HAL_DAC_IsEnabledChannelDMADoubleDataMode(hal_dac_handle_t *hdac,
                                                                                hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

  p_instance = DAC_GET_INSTANCE(hdac);

  return ((hal_dac_dma_double_data_mode_status_t) LL_DAC_IsDMADoubleDataModeEnabled(p_instance, lut_ch[channel]));
}
#endif /* defined(USE_HAL_DAC_DMA) */

/**
  * @brief Set sample and hold configuration for a channel.
  * @param hdac Pointer to a hal_dac_handle_t structure that contains
  *        the configuration information for the specified DAC.
  * @param channel The selected DAC channel.
  * @param p_config Pointer to sample and hold mode structure parameters.
  * @retval HAL_OK DAC  Instance has been correctly configured.
  * @retval HAL_ERROR   Internal timeout (to long time before writing in DAC_SHSRx has been completed).
  * @retval HAL_INVALID_PARAM  If p_config is NULL.
  */
hal_status_t HAL_DAC_SetConfigChannelSampleAndHold(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                                   const hal_dac_channel_sample_and_hold_config_t *p_config)
{
  DAC_TypeDef *p_instance;
  uint32_t tickstart;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_DAC_SAMPLE_TIME(p_config->sample_time_cycle));
  ASSERT_DBG_PARAM(IS_DAC_HOLD_TIME(p_config->hold_time_cycle));
  ASSERT_DBG_PARAM(IS_DAC_REFRESH_TIME(p_config->refresh_time_cycle));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Sample and hold configuration */
  tickstart = HAL_GetTick();
  /* SHSR1 for channel x can be written when BWSTx is cleared */
  while (LL_DAC_IsActiveFlag_BWST(p_instance, lut_ch[channel]) != 0UL)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > DAC_TIMEOUT_FOR_BWST_MS)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_DAC_IsActiveFlag_BWST(p_instance, lut_ch[channel]) != 0UL)
      {
        return HAL_ERROR;
      }
    }
  }

  LL_DAC_SetSampleAndHoldSampleTime(p_instance, lut_ch[channel],
                                    (p_config->sample_time_cycle & DAC_SHSR1_TSAMPLE1_Msk));

  LL_DAC_SetSampleAndHoldHoldTime(p_instance, lut_ch[channel],
                                  (p_config->hold_time_cycle & DAC_SHHR_THOLD1_Msk));

  LL_DAC_SetSampleAndHoldRefreshTime(p_instance, lut_ch[channel],
                                     (p_config->refresh_time_cycle & DAC_SHRR_TREFRESH1_Msk));

  return HAL_OK;
}

/**
  * @brief Get sample and hold  configuration for a channel.
  * @param hdac Pointer to a hal_dac_handle_t structure that contains
  *        the configuration information for the specified DAC.
  * @param channel The selected DAC channel.
  * @param p_config Pointer to sample and hold structure parameters.
  */
void HAL_DAC_GetConfigChannelSampleAndHold(const hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                           hal_dac_channel_sample_and_hold_config_t *p_config)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

  p_instance = DAC_GET_INSTANCE(hdac);

  p_config->sample_time_cycle  = LL_DAC_GetSampleAndHoldSampleTime(p_instance, lut_ch[channel]);
  p_config->hold_time_cycle    = LL_DAC_GetSampleAndHoldHoldTime(p_instance, lut_ch[channel]);
  p_config->refresh_time_cycle = LL_DAC_GetSampleAndHoldRefreshTime(p_instance, lut_ch[channel]);
}

/**
  * @brief Enable the DAC sample and hold mode for a channel.
  * @param hdac Pointer to a hal_dac_handle_t.
  * @param channel The selected DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_EnableChannelSampleAndHold(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE((hdac->channel_state[(uint32_t)channel]), (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  p_instance = DAC_GET_INSTANCE(hdac);

  /* Write the sample_and_hold_mode in DAC_MCR register */
  LL_DAC_SetOutputMode(p_instance, lut_ch[channel], (uint32_t)HAL_DAC_SAMPLE_AND_HOLD_ENABLED);

  return HAL_OK;
}

/**
  * @brief Disable the DAC sample and hold mode for a channel.
  * @param hdac Pointer to a hal_dac_handle_t.
  * @param channel The selected DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_DisableChannelSampleAndHold(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

