MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  p_instance = DAC_GET_INSTANCE(hdac);

  /* Write the sample_and_hold_mode in DAC_MCR register */
  LL_DAC_SetOutputMode(p_instance, lut_ch[channel], (uint32_t)HAL_DAC_SAMPLE_AND_HOLD_DISABLED);

  return HAL_OK;
}

/**
  * @brief Check whether the DAC sample-and-hold mode is enabled for a channel.
  * @param hdac Pointer to a hal_dac_handle_t.
  * @param channel The selected DAC channel.
  * @retval hal_dac_sample_and_hold_status_t Sample and hold state:
            + HAL_DAC_SAMPLE_AND_HOLD_ENABLED
            + HAL_DAC_SAMPLE_AND_HOLD_DISABLED.
  */
hal_dac_sample_and_hold_status_t HAL_DAC_IsEnabledChannelSampleAndHold(hal_dac_handle_t *hdac,
                                                                       hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

  p_instance = DAC_GET_INSTANCE(hdac);

  return ((hal_dac_sample_and_hold_status_t) LL_DAC_GetOutputMode(p_instance, lut_ch[channel]));
}

/**
  * @brief  Enable the DAC channel adding triangle wave.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The DAC channel.
  * @param  amplitude The triangle wave amplitude.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_EnableChannelAddingTriangleWave(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                                     hal_dac_wave_amplitude_t amplitude)
{
  DAC_TypeDef *p_instance;
  uint32_t cr_value;
  uint32_t cr_mask;

  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));
  ASSERT_DBG_PARAM(IS_DAC_WAVE_AMPLITUDE(amplitude));

  /* The MAMPx[3:0] bits must be configured before enabling the DAC, otherwise they cannot be changed.
    So the DAC channel must be disabled */
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE((hdac->channel_state[(uint32_t)channel]), (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  p_instance = DAC_GET_INSTANCE(hdac);

  /** Set the triangle wave generation amplitude for the DAC channel,
    * and enable the triangle wave generation for the DAC channel
    */
  cr_value = LL_DAC_READ_REG(p_instance, CR);

  cr_mask = ((DAC_CR_MAMP1) | (DAC_CR_WAVE1)) << lut_ch_shift[channel];
  cr_value &= ~cr_mask ;
  cr_value |= ((uint32_t)(amplitude) | (uint32_t)(LL_DAC_WAVE_AUTO_GENERATION_TRIANGLE)) << lut_ch_shift[channel];

  LL_DAC_WRITE_REG(p_instance, CR, cr_value);

  return HAL_OK;
}

/**
  * @brief  Disable the DAC channel adding triangle wave.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_DisableChannelAddingTriangleWave(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  p_instance = DAC_GET_INSTANCE(hdac);

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

  /* Disable the triangle wave generation for the DAC channel */
  LL_DAC_SetWaveAutoGeneration(p_instance, lut_ch[channel], LL_DAC_WAVE_AUTO_GENERATION_NONE);

  return HAL_OK;
}

/**
  * @brief  Enable the DAC channel adding noise wave.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The DAC channel.
  * @param  amplitude Noise amplitude used for pseudo noise wave generation.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_EnableChannelAddingNoiseWave(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                                  hal_dac_wave_amplitude_t amplitude)
{
  DAC_TypeDef *p_instance;
  uint32_t cr_value;
  uint32_t cr_mask;

  ASSERT_DBG_PARAM((hdac != NULL));
  p_instance = DAC_GET_INSTANCE(hdac);

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));
  ASSERT_DBG_PARAM(IS_DAC_WAVE_AMPLITUDE(amplitude));

  /* The MAMPx[3:0] bits must be configured before enabling the DAC, otherwise they cannot be changed.
    So the DAC channel must be disabled */
  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);
  ASSERT_DBG_STATE((hdac->channel_state[(uint32_t)channel]), (uint32_t)HAL_DAC_CHANNEL_STATE_IDLE);

  /** Set the amplitude for the DAC channel LFSR used for noise wave generation
    * and enable the noise wave generation for the DAC channel
    */
  cr_value = LL_DAC_READ_REG(p_instance, CR);

  cr_mask = ((DAC_CR_MAMP1) | (DAC_CR_WAVE1)) << lut_ch_shift[channel];
  cr_value &= ~cr_mask ;
  cr_value |= ((uint32_t)(amplitude) | (uint32_t)(LL_DAC_WAVE_AUTO_GENERATION_NOISE)) << lut_ch_shift[channel];

  LL_DAC_WRITE_REG(p_instance, CR, cr_value);

  return HAL_OK;
}

/**
  * @brief  Disable the DAC channel adding noise wave.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The DAC channel.
  * @retval HAL_OK
  */
hal_status_t HAL_DAC_DisableChannelAddingNoiseWave(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  DAC_TypeDef *p_instance;

  ASSERT_DBG_PARAM((hdac != NULL));
  p_instance = DAC_GET_INSTANCE(hdac);

  ASSERT_DBG_PARAM(IS_DAC_CHANNEL(hdac, channel));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_ALL);

  /* Disable the noise wave generation for the selected DAC channel */
  LL_DAC_SetWaveAutoGeneration(p_instance, lut_ch[channel], LL_DAC_WAVE_AUTO_GENERATION_NONE);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup DAC_Exported_Functions_Group4 Callback functions and callback register functions
  This section is about callbacks functions:
    + The weak callbacks functions.
    + The register callback functions.
  * @{
  */

/**
  * @brief  Conversion complete callback in non-blocking mode for the channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  */
__WEAK void HAL_DAC_ConvCpltCallback(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);
  STM32_UNUSED(channel);

  /* NOTE: This function must not be modified when the callback is needed,
            the HAL_DAC_ConvCpltCallback could be implemented in the user file.
   */
}

/**
  * @brief  Conversion half DMA transfer callback in non-blocking mode for the channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  */
__WEAK void HAL_DAC_ConvHalfCpltCallback(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);
  STM32_UNUSED(channel);

