MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  /* NOTE: This function must not be modified when the callback is needed,
            the HAL_DAC_ConvHalfCpltCallback could be implemented in the user file.
   */
}

/**
  * @brief  DAC stop callback.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  */
__WEAK void HAL_DAC_StopCpltCallback(hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);
  STM32_UNUSED(channel);

  /* NOTE: This function must not be modified when the callback is needed,
           the HAL_DAC_StopCpltCallback could be implemented in the user file.
   */
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/**
  * @brief  Conversion complete callback in non-blocking mode for dual channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  */
__WEAK void HAL_DAC_DualChannelConvCpltCallback(hal_dac_handle_t *hdac)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);

  /* NOTE: This function must not be modified when the callback is needed,
            the HAL_DAC_DualChannelConvCpltCallback could be implemented in the user file.
   */
}

/**
  * @brief  Conversion half DMA transfer callback in non-blocking mode for dual channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  */
__WEAK void HAL_DAC_DualChannelConvHalfCpltCallback(hal_dac_handle_t *hdac)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);

  /* NOTE: This function must not be modified when the callback is needed,
            the HAL_DAC_DualChannelConvHalfCpltCallback could be implemented in the user file.
   */
}

/**
  * @brief  DAC dual channel stop callback.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  */
__WEAK void HAL_DAC_DualChannelStopCpltCallback(hal_dac_handle_t *hdac)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);

  /* NOTE: This function must not be modified when the callback is needed,
           the HAL_DAC_DualChannelStopCpltCallback could be implemented in the user file.
   */
}
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  DAC error callback.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  */
__WEAK void HAL_DAC_ErrorCallback(hal_dac_handle_t *hdac)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdac);

  /* NOTE: This function must not be modified when the callback is needed,
           the HAL_DAC_ErrorCallback could be implemented in the user file.
   */
}

#if (USE_HAL_DAC_REGISTER_CALLBACKS == 1) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a user DAC callback to manage the completion conversion.
  *         To be used instead of the weak (overridden) predefined callback.
  * @param  hdac DAC handle
  * @param  p_callback Pointer to channel converter complete callback function.
  *
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM In case of a NULL pointer for parameter.
  */
hal_status_t HAL_DAC_RegisterConvCpltCallback(hal_dac_handle_t *hdac, hal_dac_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_conv_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user DAC callback to manage the half completion conversion.
  *         To be used instead of the weak (overridden) predefined callback.
  * @param  hdac DAC handle
  * @param  p_callback Pointer to channel converter half complete callback function.
  *
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM In case of a NULL pointer for parameter.
  */
hal_status_t HAL_DAC_RegisterConvHalfCpltCallback(hal_dac_handle_t *hdac, hal_dac_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_conv_half_cplt_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a user DAC stop completed callback.
  * @param  hdac Pointer to a hal_dac_handle_t
  * @param  p_callback Pointer to the DAC Stop completed callback
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_DAC_RegisterStopCpltCallback(hal_dac_handle_t *hdac, hal_dac_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_stop_cplt_cb = p_callback;

  return HAL_OK;
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/**
  * @brief  Register a user DAC callback to manage the dual completion conversion.
  *         To be used instead of the weak (overridden) predefined callback.
  * @param  hdac DAC handle
  * @param  p_callback Pointer to the dual channel converter complete callback function.
  *
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM In case of a NULL pointer for parameter.
  */
hal_status_t HAL_DAC_RegisterDualChannelCpltCallback(hal_dac_handle_t *hdac, hal_dac_dual_channel_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_dual_channel_conv_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user DAC callback to manage the dual half completion conversion.
  *         To be used instead of the weak (overridden) predefined callback.
  * @param  hdac DAC handle
  * @param  p_callback  Pointer to the dual channel converter half complete callback function.
  *
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM In case of a NULL pointer for parameter.
  */
hal_status_t HAL_DAC_RegisterDualChannelHalfCpltCallback(hal_dac_handle_t *hdac,
                                                         hal_dac_dual_channel_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_dual_channel_conv_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user DAC dual channel stop completed callback.
  * @param  hdac Pointer to a hal_dac_handle_t
  * @param  p_callback Pointer to the DAC dual channel stop completed callback function.
  * @retval HAL_OK Operation completed successfully
  * @retval HAL_INVALID_PARAM Invalid parameter
  */
hal_status_t HAL_DAC_RegisterDualChannelStopCpltCallback(hal_dac_handle_t *hdac, hal_dac_dual_channel_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hdac->global_state, HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_dual_channel_stop_cplt_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
/**
  * @brief  Register a user DAC callback to manage error.
  *         To be used instead of the weak (overridden) predefined callback.
  * @param  hdac DAC handle
  * @param  p_callback Pointer to the DAC channel error callback function.
  *
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM In case of a NULL pointer for parameter.
  */
hal_status_t HAL_DAC_RegisterErrorCallback(hal_dac_handle_t *hdac, hal_dac_error_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hdac->global_state, (uint32_t)DAC_STATE_CONFIG);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((hdac == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdac->p_error_cb = p_callback;
  return HAL_OK;
}
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */

/**
  * @}
  */

