MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
/** @defgroup DAC_Exported_Functions_Group5 Peripheral State, kernel clock frequency, IRQ and Errors functions
    This subsection provides functions allowing to:
      + Check the DAC state,
      + Check the DAC channels states,
      + Get the kernel clock frequency,
      + IRQ handler,
      + Check the DAC Errors.
  * @{
  */

/**
  * @brief  return the DAC handle state.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval hal_dac_state_t DAC global state.
  */
hal_dac_state_t HAL_DAC_GetState(const hal_dac_handle_t *hdac)
{
  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  return hdac->global_state;
}

/**
  * @brief  return the DAC channel state.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @retval hal_dac_channel_state_t  Channel state.
  */
hal_dac_channel_state_t HAL_DAC_GetChannelState(const hal_dac_handle_t *hdac, hal_dac_channel_t channel)
{
  ASSERT_DBG_PARAM((hdac != NULL));

  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  return (hdac->channel_state[(uint32_t)channel]);
}

/** @brief  Return the peripheral clock frequency for DAC.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval uint32_t Frequency in Hz.
  *         0 if the source clock of the DAC is not configured or not ready.
  */
uint32_t HAL_DAC_GetClockFreq(const hal_dac_handle_t *hdac)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

#if !defined(USE_ASSERT_DBG_STATE) && !defined(USE_ASSERT_DBG_PARAM)
  STM32_UNUSED(hdac);
#endif /* USE_ASSERT_DBG_STATE or USE_ASSERT_DBG_PARAM*/

  return HAL_RCC_DAC_GetKernelClkFreq(DAC_GET_INSTANCE(hdac));
}

/**
  * @brief  Handle DAC interrupt request.
  *         This function is called when an interruption for DMA underrun error occurs.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  */
void HAL_DAC_IRQHandler(hal_dac_handle_t *hdac)
{
  DAC_IRQHandlerCH(hdac, HAL_DAC_CHANNEL_1);
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL > 1)
  DAC_IRQHandlerCH(hdac, HAL_DAC_CHANNEL_2);
#endif /* DAC_NB_OF_CHANNEL */
}

/**
  * @brief  Returns the last DAC error codes in a bits field.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @retval Last error code, coded on an uint32_t bits field,
  *         it can be :
  *         + HAL_DAC_ERROR_NONE
  *         or a combinaison of the following values:
  *         + HAL_DAC_ERROR_DMA_UNDERRUN_CH1
  *         + HAL_DAC_ERROR_DMA_CH1
  *         + HAL_DAC_ERROR_DMA_UNDERRUN_CH2
  *         + HAL_DAC_ERROR_DMA_CH2
  */
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
uint32_t HAL_DAC_GetLastErrorCodes(const hal_dac_handle_t *hdac)
{
  uint32_t tmp;

  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  /* In two steps as last_error_codes is volatile */
  tmp  = hdac->last_error_codes[HAL_DAC_CHANNEL_1];
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  tmp |= hdac->last_error_codes[HAL_DAC_CHANNEL_2];
#endif /* DAC_NB_OF_CHANNEL */
  return tmp;
}
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

/**
  * @}
  */
/** @defgroup DAC_Exported_Functions_Group6  User Data API functions
    This subsection provides functions allowing to:
      + Set a user data pointer (ex: a user context) in a DAC handle,
      + Get a user data pointer (ex: a user context) from a DAC handle.
    @note A typical usage is to set user data pointer before starting a data conversion,<br>
          then retrieve it within the user conversion completion callback.
  * @{
  */
#if defined(USE_HAL_DAC_USER_DATA) && (USE_HAL_DAC_USER_DATA == 1)
/**
  * @brief  Store user data pointer into the DAC handle.
  * @param  hdac Pointer to a hal_dac_handle_t.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_DAC_SetUserData(hal_dac_handle_t *hdac, const void *p_user_data)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  hdac->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve user data pointer from the DAC handle.
  * @param  hdac Pointer to a hal_dac_handle_t.
  * @retval (void*) the pointer to the user data, when previously set by HAL_DAC_SetUserData().
  * @retval NULL other way.
  */
const void *HAL_DAC_GetUserData(const hal_dac_handle_t *hdac)
{
  ASSERT_DBG_PARAM((hdac != NULL));
  ASSERT_DBG_STATE(hdac->global_state, DAC_STATE_ALL);

  return (hdac->p_user_data);
}
#endif /* USE_HAL_DAC_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup DAC_Private_Functions
  * @{
  */

/**
  * @brief  Ensure a minimum wait of delay_us in microsecond.
  * @param  delay_us The delay in microsecond.
  */
static void DAC_WaitMicroSecond(uint32_t delay_us)
{
  volatile uint32_t wait_loop_index;

  /**
    * Wait loop initialization and execution.
    * Note: Variable divided by 2 to compensate partially CPU processing cycles, scaling in us split to not exceed 32
    *       bits register capacity and handle low frequency.
    */
  wait_loop_index = ((delay_us / 10UL) * ((SystemCoreClock / (100000UL * 2UL)) + 1UL));
  while (wait_loop_index > 0UL)
  {
    wait_loop_index--;
  }
}

/**
  * @brief  Set the data width and alignment for the DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  alignment  The alignment and data width:
  *                    12 bits right alignment, 12 bits left alignment, 8 bits right alignment.
  */
static void DAC_SetChannelAlignment(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                    hal_dac_data_alignment_t alignment)
{
  DAC_TypeDef *p_instance = DAC_GET_INSTANCE(hdac);

  /**
    * Computes and stores the channel data hold register address from the given channel and alignment
    * One among those register addresses:
    * uint32_t DHR12R1;   DAC channel1 12-bit right aligned data holding register, Address offset: 0x08
    * uint32_t DHR12L1;   DAC channel1 12-bit left  aligned data holding register, Address offset: 0x0C
    * uint32_t DHR8R1;    DAC channel1  8-bit right aligned data holding register, Address offset: 0x10
    * uint32_t DHR12R2;   DAC channel2 12-bit right aligned data holding register, Address offset: 0x14
    * uint32_t DHR12L2;   DAC channel2 12-bit left  aligned data holding register, Address offset: 0x18
    * uint32_t DHR8R2;    DAC channel2  8-bit right aligned data holding register, Address offset: 0x1C
    */
  hdac->channel_dhr_address[(uint32_t)channel]  = (volatile uint32_t *)(&(p_instance->DHR12R1));
  hdac->channel_dhr_address[(uint32_t)channel] += (uint32_t)(3UL * (uint32_t)channel);
  hdac->channel_dhr_address[(uint32_t)channel] += (uint32_t)(alignment);
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/**
  * @brief  Set the data width and alignment for the DAC channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  alignment  The alignment and data width:
  *                    12 bits right alignment, 12 bits left alignment, 8 bits right alignment.
  */
static void DAC_SetDualChannelAlignment(hal_dac_handle_t *hdac, hal_dac_data_alignment_t alignment)
{
  DAC_TypeDef *p_instance = DAC_GET_INSTANCE(hdac);

  /**
    * Computes and stores the channel data hold register address for dual channel and alignment
    * Stored in [HAL_DAC_CHANNEL_1] as separate channel is not running when in dual channel
    * One among those register addresses:
    * uint32_t DHR12RD;   Dual DAC     12-bit right aligned data holding register, Address offset: 0x20
    * uint32_t DHR12LD;   Dual DAC     12-bit left  aligned data holding register, Address offset: 0x24
    * uint32_t DHR8RD;    Dual DAC      8-bit right aligned data holding register, Address offset: 0x28
    */
  hdac->channel_dhr_address[(uint32_t)HAL_DAC_CHANNEL_1]  = (volatile uint32_t *)(&(p_instance->DHR12RD));
  hdac->channel_dhr_address[(uint32_t)HAL_DAC_CHANNEL_1] += (uint32_t)(alignment);
}
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/**
  * @brief  Set the link between DAC channel and a DMA handler.
  * @param  hdac Pointer to hal_dac_handle_t structure.
  * @param  hdma Pointer to the DMA handler to be linked with the DAC channel.
  * @param  channel The selected DAC channel.
  */
static void DAC_SetChannelDMA(hal_dac_handle_t *hdac, hal_dma_handle_t *hdma, hal_dac_channel_t channel)
{
  hdac->dma_ch[(uint32_t)channel] = hdma;
  hdma->p_parent = hdac;
}

/**
  * @brief  DMA conversion complete callback for the DAC channel.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *                the configuration information for the specified DMA module.
  */
static void DAC_DMA_ChConvCplt(hal_dma_handle_t *hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);
  hal_dac_channel_t channel = HAL_DAC_CHANNEL_1;

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  if (hdac->dma_ch[HAL_DAC_CHANNEL_2] == hdma)
  {
    channel = HAL_DAC_CHANNEL_2;
  }
#endif /* DAC_NB_OF_CHANNEL */

  /* Call conversion complete callback */
#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_conv_cplt_cb(hdac, channel);
#else
  HAL_DAC_ConvCpltCallback(hdac, channel);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA half transfer complete callback for the DAC channel.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void DAC_DMA_ChHalfConvCplt(hal_dma_handle_t *hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);
  hal_dac_channel_t channel = HAL_DAC_CHANNEL_1;

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  if (hdac->dma_ch[HAL_DAC_CHANNEL_2] == hdma)
  {
    channel = HAL_DAC_CHANNEL_2;
  }
#endif /* DAC_NB_OF_CHANNEL */

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_conv_half_cplt_cb(hdac, channel);
#else
  HAL_DAC_ConvHalfCpltCallback(hdac, channel);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA stop callback, when initiated by user by a call to HAL_DAC_StopChannel_DMA API
  *         (This callback is executed at end of DMA stop procedure following user stop request,
  *         and leads to user HAL_DAC_DMA_StopCallback() callback execution).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void DAC_DMA_ChStopCplt(hal_dma_handle_t *hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);
  hal_dac_channel_t channel = HAL_DAC_CHANNEL_1;

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  if (hdac->dma_ch[HAL_DAC_CHANNEL_2] == hdma)
  {
    channel = HAL_DAC_CHANNEL_2;
  }
#endif /* DAC_NB_OF_CHANNEL */

