MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  hdac->global_state = HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED;
  hdac->channel_state[channel] = HAL_DAC_CHANNEL_STATE_IDLE;

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_stop_cplt_cb(hdac, channel);
#else
  HAL_DAC_StopCpltCallback(hdac, channel);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA error callback for the DAC channel.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void DAC_DMA_ChError(hal_dma_handle_t *const hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  if (hdac->dma_ch[HAL_DAC_CHANNEL_1] == hdma)
  {
    /* The hdma is used with DAC channel 1 */
    hdac->last_error_codes[HAL_DAC_CHANNEL_1] |= (uint16_t)(HAL_DAC_ERROR_DMA_CH1);
  }
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  else
  {
    /* The hdma is used with DAC channel 2 */
    hdac->last_error_codes[HAL_DAC_CHANNEL_2] |= (uint16_t)(HAL_DAC_ERROR_DMA_CH2);
  }
#endif /* DAC_NB_OF_CHANNEL */
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_error_cb(hdac);
#else
  HAL_DAC_ErrorCallback(hdac);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  Enable DAC and start conversion of channel.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  * @param  p_data The source buffer address.
  * @param  size_byte The number of bytes of data to be transferred from memory to DAC peripheral
  * @param  dma_opt_interrupt The DMA optional interrupt flag.
  * @retval HAL_OK DAC instance has been correctly configured with the DMA.
  * @retval HAL_ERROR An internal inconsistency error or a parameter is invalid.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          DMA channel state is active when calling this API.
  */
static hal_status_t DAC_StartChannel_DMA_Opt(hal_dac_handle_t *hdac, hal_dac_channel_t channel, const void *p_data,
                                             uint32_t size_byte, uint32_t dma_opt_interrupt)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  static const uint16_t lut_ch_err_dma[DAC_NB_OF_CHANNEL] = {HAL_DAC_ERROR_DMA_CH1,
                                                             HAL_DAC_ERROR_DMA_CH2
                                                            };
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
#else
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  static const uint16_t lut_ch_err_dma[DAC_NB_OF_CHANNEL] = {HAL_DAC_ERROR_DMA_CH1};
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
#endif /* DAC_NB_OF_CHANNEL */
  hal_status_t status;
  DAC_TypeDef *p_instance;
  hal_dma_handle_t *p_hdma;

  p_instance = DAC_GET_INSTANCE(hdac);

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  hdac->last_error_codes[channel] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

  p_hdma = hdac->dma_ch[channel];

  p_hdma->p_xfer_cplt_cb     = DAC_DMA_ChConvCplt;
  p_hdma->p_xfer_halfcplt_cb = DAC_DMA_ChHalfConvCplt;
  p_hdma->p_xfer_error_cb    = DAC_DMA_ChError;

  LL_DAC_EnableDMAReq(p_instance, lut_ch[channel]);

  LL_DAC_EnableIT_DMAUDR(p_instance, lut_ch_dma_underrun_it[channel]);

  /* Enable the DMA channel */
  status = HAL_DMA_StartPeriphXfer_IT_Opt(p_hdma, (uint32_t)p_data,
                                          (uint32_t)(hdac->channel_dhr_address[(uint32_t)channel]),
                                          size_byte, dma_opt_interrupt);

  if (status == HAL_OK)
  {
    LL_DAC_Enable(p_instance, lut_ch[channel]);

    /* Ensure minimum wait before using peripheral after enabling it */
    DAC_WaitMicroSecond(DAC_DELAY_STARTUP_US);
  }
  else
  {
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
    hdac->last_error_codes[(uint32_t)channel] |= (uint16_t)lut_ch_err_dma[channel];
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
  }

  return status;
}

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/**
  * @brief  DMA conversion complete callback when in dual channel mode.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void DAC_DMA_DualChannelConvCplt(hal_dma_handle_t *hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_dual_channel_conv_cplt_cb(hdac);
#else
  HAL_DAC_DualChannelConvCpltCallback(hdac);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA half transfer complete callback when in dual channel mode.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void DAC_DMA_DualChannelHalfConvCplt(hal_dma_handle_t *hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_dual_channel_conv_half_cplt_cb(hdac);
#else
  HAL_DAC_DualChannelConvHalfCpltCallback(hdac);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA dual channel stop callback, when initiated by user by a call to HAL_DAC_DualChannelStop_DMA()
  *         (This callback is executed at end of DMA stop procedure following user stop request,
  *         and leads to user HAL_DAC_DualChannelStopCpltCallback() callback execution).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void DAC_DMA_DualChannelStopCplt(hal_dma_handle_t *hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);

