MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.c
  hdac->global_state = HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED;
  hdac->channel_state[HAL_DAC_CHANNEL_1] = HAL_DAC_CHANNEL_STATE_IDLE;
  hdac->channel_state[HAL_DAC_CHANNEL_2] = HAL_DAC_CHANNEL_STATE_IDLE;

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_dual_channel_stop_cplt_cb(hdac);
#else
  HAL_DAC_DualChannelStopCpltCallback(hdac);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA error callback when in dual channel mode.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void DAC_DMA_DualChannelError(hal_dma_handle_t *const hdma)
{
  hal_dac_handle_t *hdac = DAC_GET_DMA_PARENT(hdma);

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  hdac->last_error_codes[HAL_DAC_CHANNEL_1] |= (uint16_t)(HAL_DAC_ERROR_DMA_CH1);
  hdac->last_error_codes[HAL_DAC_CHANNEL_2] |= (uint16_t)(HAL_DAC_ERROR_DMA_CH2);
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->p_error_cb(hdac);
#else
  HAL_DAC_ErrorCallback(hdac);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */

}

/**
  * @brief  Enable DAC, and start conversion with a DMA, of both channels of the same DAC.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  p_data The destination peripheral Buffer address.
  * @param  size_byte The number of data to be transferred from memory to DAC peripheral.
  * @param  dma_opt_interrupt The DMA optional interrupt flag.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  */
hal_status_t DAC_StartDualChannel_DMA_Opt(hal_dac_handle_t *hdac, const void *p_data, uint32_t size_byte,
                                          uint32_t dma_opt_interrupt)
{
  DAC_TypeDef *p_instance;
  hal_status_t status;
  hal_dma_handle_t *p_hdma;

  p_instance = DAC_GET_INSTANCE(hdac);

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  hdac->last_error_codes[(uint32_t)HAL_DAC_CHANNEL_1] = (uint16_t)HAL_DAC_ERROR_NONE;
  hdac->last_error_codes[(uint32_t)HAL_DAC_CHANNEL_2] = (uint16_t)HAL_DAC_ERROR_NONE;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

  p_hdma = hdac->dma_ch[hdac->dual_channel_dma_requester];

  p_hdma->p_xfer_cplt_cb     = DAC_DMA_DualChannelConvCplt;
  p_hdma->p_xfer_halfcplt_cb = DAC_DMA_DualChannelHalfConvCplt;
  p_hdma->p_xfer_error_cb    = DAC_DMA_DualChannelError;

  LL_DAC_EnableDMAReq(p_instance, lut_ch[hdac->dual_channel_dma_requester]);
  LL_DAC_EnableIT_DMAUDR(p_instance, lut_ch_dma_underrun_it[hdac->dual_channel_dma_requester]);
  /* Enable the DMA channel, data holding register same that on HAL_DAC_CHANNEL_1*/
  status = HAL_DMA_StartPeriphXfer_IT_Opt(p_hdma, (uint32_t)p_data,
                                          (uint32_t)(hdac->channel_dhr_address[(uint32_t)HAL_DAC_CHANNEL_1]),
                                          size_byte, dma_opt_interrupt);

  if (status == HAL_OK)
  {
    LL_DAC_DualChannelEnable(p_instance);

    /* Ensure minimum wait before using peripheral after enabling it */
    DAC_WaitMicroSecond(DAC_DELAY_STARTUP_US);
  }
  else
  {
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
    hdac->last_error_codes[(uint32_t)HAL_DAC_CHANNEL_1] |= (uint16_t)HAL_DAC_ERROR_DMA_CH1;
    hdac->last_error_codes[(uint32_t)HAL_DAC_CHANNEL_2] |= (uint16_t)HAL_DAC_ERROR_DMA_CH2;
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
  }

  return status;
}

#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
#endif /* USE_HAL_DAC_DMA */
/**
  * @brief  Handle DAC interrupt request management by channel.
  *         This function is called when an interruption for DMA underrun error occurs.
  * @param  hdac Pointer to a hal_dac_handle_t structure.
  * @param  channel The selected DAC channel.
  */
__STATIC_INLINE void DAC_IRQHandlerCH(hal_dac_handle_t *const hdac, hal_dac_channel_t channel)
{
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  static const uint32_t lut_ch_dma_underrun_flag[DAC_NB_OF_CHANNEL] = {LL_DAC_FLAG_DMAUDR1,
                                                                       LL_DAC_FLAG_DMAUDR2
                                                                      };
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  static const uint16_t lut_ch_dma_underrun_error_code[DAC_NB_OF_CHANNEL] = {HAL_DAC_ERROR_DMA_UNDERRUN_CH1,
                                                                             HAL_DAC_ERROR_DMA_UNDERRUN_CH2
                                                                            };
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
#else
  static const uint32_t lut_ch_dma_underrun_flag[DAC_NB_OF_CHANNEL] = {LL_DAC_FLAG_DMAUDR1};
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  static const uint16_t lut_ch_dma_underrun_error_code[DAC_NB_OF_CHANNEL] = {HAL_DAC_ERROR_DMA_UNDERRUN_CH1};
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */
#endif /* DAC_NB_OF_CHANNEL */
  DAC_TypeDef *p_instance;
  p_instance = DAC_GET_INSTANCE(hdac);

  if (LL_DAC_IsEnabledIT_DMAUDR(p_instance, lut_ch_dma_underrun_it[channel]) != 0UL)
  {
    if (LL_DAC_IsActiveFlag_DMAUDR(p_instance, lut_ch_dma_underrun_flag[channel]) != 0UL)
    {
      LL_DAC_ClearFlag_DMAUDR(p_instance, lut_ch_dma_underrun_flag[channel]);

      LL_DAC_DisableDMAReq(p_instance, lut_ch[channel]);

      /* Set DAC error code to channel1 DMA underrun error */
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
      hdac->last_error_codes[channel] |= (uint16_t)lut_ch_dma_underrun_error_code[channel];
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

#if defined(USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
      hdac->p_error_cb(hdac);
#else
      HAL_DAC_ErrorCallback(hdac);
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_DAC_MODULE */
#endif /* DAC1 || DAC2 */
/**
  * @}
  */
